[
  {
    "name_small": "Merlin Cube Mobile Projector (Black)",
    "price": "₹27,990.00",
    "Key features": "",
    "Media Formats Supported": {
      "Supported file formats": "PNG/BMP/JPEG/JPG (Photo), DAT/FLV/MKV/MOV/MP4/MPG/RM/TRP/ TS/WMB/RMVB (Video), AAC/FLAC/M4A/OGG/MP3/WAV/WMA (Audio)"
    },
    "Speaker Features": {
      "Speaker": "Yes (Built-In), 1.5 W (x1)"
    },
    "Connectivity": {
      "Wireless Connectivity": "Miracast (Android), Airplay(iOS)"
    },
    "Main Product Features": {
      "Power Supply": "Micro USB type"
    },
    "Input Output Ports": {
      "Audio out": "3.5 mm"
    },
    "Audio Specifications": {
      "Impedance (Ohms)": "8 (Speaker)"
    },
    "Additional Features": {
      "Other features": "Mini Projector, Light Source (RGB LED), Focus (Manual Adjust), LED working life (Above 30000 Hours)",
      "Lamp": "DLP / LED"
    },
    "Resolution": {
      "Resolution": "Native : 854 x 480 (FWVGA), 640 x 480-1920 x 1080 (Compatible)"
    },
    "Dimension and Weigth": {
      "Weight (g)": "174",
      "Dimensions": "55 x 55 x 55 mm"
    },
    "Brightness Features": {
      "Brightness": "100 Lumens (ANSI)"
    },
    "Display Features": {
      "display": "Technology (TI DLP)",
      "Contrast ratio": "1000:1"
    },
    "Convenience Features": {
      "Moisture or Humidity control": "Relative Working Humidity (10-90 Percent)"
    },
    "Look and Feel": {
      "Design": "Cube",
      "Colour": "Black"
    },
    "General": {
      "Type": "Mobile Projector",
      "Brand": "Merlin"
    },
    "Power Features": {
      "Battery voltage (Volts)": "3.7"
    },
    "Battery Features": {
      "Battery capacity (mAh)": "2500"
    },
    "Power": {
      "Power consumption (watts)": "8.5",
      "Current (amps)": "2",
      "Power requirements (volts)": "DC 5",
      "Input": "Mini HDMI/ Micro SD slot (up to 64GB)"
    },
    "category": "projector",
    "url": "https://www.croma.com/merlin-cube-mobile-projector-black-/p/209201",
    "description": "Description for Merlin Cube Mobile Projector (Black) Take your entertainment to new levels and enjoy a completely new dimension with the amazing and portable Merlin Cube Mobile Projector. The projector can be connected to your smartphones, laptops and gaming consoles to give you entertainment levels like never before. The display of the projector stretches up to 120 inches to give you a broad spectrum for you to enjoy your entertainment wherever you are. The projector gives you a battery life of up to 120 minutes to give you optimum usage. All these features coupled in with a durable and portable design makes it an ideal option to have wherever you go. Flexible Performance Your entertainment levels are sure to take a new dimension as the Merlin Cube Mobile Projector with its compatibility with a wide range of devices makes for an ideal entertainment option wherever you go The projector is compatible with mobiles, tablets and gaming consoles to provide you with larger than life entertainment wherever you go. The projector also comes with built-in speakers with Aux out the option to enhance your entertainment levels. So connect your devices to the projector and play games and watch movies with friends for a brilliant experience. Convenient Design Brilliant entertainment is coupled with a portable design to ensure you never have to stay without having a good time. The projector comes with a 2500 mAh rechargeable battery gives you a 120-minute battery life for optimum functionality. The projector is built with aluminum yet is extremely lightweight and fits right into your pocket making it a portable option for you."
  },
  {
    "name_small": "Merlin LCD Projector",
    "price": "₹6,390.00",
    "Key features": "",
    "Connectivity": {
      "Connectivity": "AV, HDMI, USB and microSD"
    },
    "Main Product Features": {
      "Life cycle": "30,000 Hours (LED)"
    },
    "Additional Features": {
      "Other features": "Projection Size: 24-60 Inches (at 2 Meters)"
    },
    "Resolution": {
      "Resolution": "1920 x 1080"
    },
    "Dimension and Weigth": {
      "Weight (g)": "300",
      "Dimensions": "126.4 x 85.8 x 47.7 mm"
    },
    "Display Features": {
      "display": "High-Contrast Display with LCD Technology",
      "Contrast ratio": "800:1",
      "Aspect ratio": "4:3",
      "Brightness": "20 Lumens"
    },
    "General": {
      "Brand": "Merlin",
      "Type": "LCD Pocket Projector"
    },
    "Battery Features": {
      "Battery": "7.4V, 1,300mAh Lithium-ion"
    },
    "category": "projector",
    "url": "https://www.croma.com/merlin-lcd-projector/p/200991",
    "description": "Description for Merlin LCD Projector Take your entertainment to new levels and enjoy a completely new dimension with the amazing and portable Merlin LCD Pocket Projector. Featuring 20 lumens and support for 1920x1080 Full HD resolution, the palm-sized LCD Projector lets you easily share videos, photos and graphics at home or on the road. The display of the projector stretches up to 60 inches to give you a broad spectrum for you to enjoy your entertainment wherever you are. The projector gives you a really long battery life to give you optimum usage while the vibrant LED light projection comes with an array of ports for wide connectivity options. All these features coupled in with a durable and portable design makes it an ideal option to have wherever you go. Brilliant Performance The Merlin LCD Pocket Projector is sure to satisfy all your needs and allows you to take your presentations and movies wherever you go. Featuring 20 lumens and support for 1920x1080 Full HD resolution, the palm-sized LCD Projector lets you easily share videos, photos and graphics at home or on the road. The projector allows you to share movies, games and more with large, wide-screen images of up to 60 inches. The projector comes with low power consumption to ensure long battery life so that your needs are not halted for long hours. Flexible Connectivity The Merlin LCD Pocket Projector comes with multiple connectivity options and connects readily to most analog and digital devices. The projector has an array of ports for wide connectivity while the lightweight design allows you to take it everywhere you go."
  }
]
