[
  {
    "name_small": "HP Envy Curved 34-b151in (4LZ53AA) Core i5 8th Gen Windows 10 All-in-One Desktop (8 GB + 16 GB Optane, 1 TB HDD, 4 GB Graphics, 86.36 cm, Black)",
    "price": "₹165,990.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "1 TB"
    },
    "Connectivity": {
      "Wireless": "802.11a/b/g/n/ac (2x2) Wi-Fi",
      "Bluetooth Version": "v4.2 M.2 combo"
    },
    "Main Product Features": {
      "Power Supply": "280 W external AC Power Adapter"
    },
    "Ports": {
      "LAN Interface": "Integrated 10/100/1000 GbE LAN"
    },
    "Input Output Ports": {
      "Ports": "I/O Port location (Side, Rear)",
      "USB Interface": "1 USB 3.1 Gen 1, 4 USB 3.1 Gen 1"
    },
    "Input Output Devices": {
      "Webcam": "HP Truevision FHD IR camera with dual array Digital Microphone",
      "Keyboard": "HP Premium Lifestyle Wireless Keyboard With Volume Control"
    },
    "Operating System": {
      "Operating System": "Windows 10 Home"
    },
    "memory": {
      "ramcapacity": "8 GB DDR4",
      "Expandable Memory capacity": "16 GB Optane"
    },
    "Dimension and Weigth": {
      "Weight (kg)": "11.5"
    },
    "Additional Features": {
      "Other features": "Expansion slots (2 M.2), Pointing device (HP ENVY Wireless Mouse)"
    },
    "Look and Feel": {
      "Design": "Curved",
      "Colour": "Black"
    },
    "Graphics Processor": {
      "Graphics processor brand": "NVIDIA",
      "Graphics processor version": "GeForce GTX 1050",
      "Graphics processor": "4 GB GDDR5 dedicated"
    },
    "Processor": {
      "Processor variant": "8400T",
      "Processor name": "Core i5 (8th Gen)",
      "Processor brand": "Intel",
      "Processor speed": "1.7 GHz Base Frequency, up to 3.3 GHz with Intel Turbo Boost Technology",
      "processor": "9 MB cache, 6 cores"
    },
    "Display Features": {
      "display": "86.36 cm diagonal WQHD IPS anti-glare WLED-backlit (3440 x 1440)"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "Manufacturer Details": {
      "Brand": "HP",
      "Model Series": "Envy Curved 34-b151in",
      "Model Number": "4LZ53AA",
      "Manufacturer Name": "HP"
    },
    "Product Aesthetics": {
      "Color": "Ash Silver Sparkle",
      "Color Family": "Black"
    },
    "In the Box": {
      "Main Product": "1 x Desktop U",
      "Accessories": "Charging Cable Charging Adopter"
    },
    "Product Dimensions (Open)": {
      "Dimensions in CM (W x D x H)": "81.5 x 20 x 45.8",
      "Dimensions in Inches (W x D x H)": "32.1 x 7.9 x 18.0"
    },
    "After Sales & Services": {
      "Standard Warranty Period": "36 (Limited Parts) Months"
    },
    "Company Contact Information": {
      "Generic Name": "Desktop"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-envy-curved-34-b151in-4lz53aa-core-i5-8th-gen-windows-10-all-in-one-desktop-8-gb-+-16-gb-optane-1-tb-hdd-4-gb-graphics-86-36-cm-black-/p/215065",
    "description": "Description for HP Envy Curved 34-b151in (4LZ53AA) Core i5 8th Gen Windows 10 All-in-One Desktop (8 GB + 16 GB Optane, 1 TB HDD, 4 GB Graphics, 86.36 cm, Black) The HP 34-b151in All-in-One Desktop has been integrated to give high performance with HD games and the large screen size delivers the full media content of websites, social media and videos for official and casual use. The superfast and powerful Intel Core i5 Processor ensures you can multitask between various applications and websites at one go and enjoy a smooth and vibrant computing experience. Feel the future with the HP 34-b151in All-in-One Desktop, and feel the power of the Intel-driven chipset in your day to day work and enjoy lag-free awesome gaming as well. Amazing Functionality You could go for the fantastic all-in-one desktop ensures all your official and recreational needs and necessities are taken care of to give you optimum performance levels. It has a display size of 86.36 cm. The HP 34-b151in All-in-One Desktop has been designed to give you uninterrupted performance with the latest cutting-edge technology incorporated into a powerful compact desktop. The powerful processor and the 8 GB RAM gives you lag-free toggling between applications and games while the ROM space allows you to use the desktop at full function. Awesome Graphics The stylish and unique design of the HP 34-b151in All-in-One Desktop grabs the attention of all tech savvy people. Finished with specially engineered material that provides this awesome gadget strength and finesse. The HP 34-b151in All-in-One Desktop has a sleek design that imparts efficiency, performance along with no extra weight for you to carry. The desktop is not only equipped with high-end features but with it you can bring your biggest, boldest ideas to life or multi-task like a master and play games with fantastic graphics with the fantastic Nvidia GeForce GTX 1050 Graphics."
  },
  {
    "name_small": "HP 22-C0020in Core i3 8th Gen All-in-One Desktop (4 GB, 1 TB HDD, 55.88 cm, Black)",
    "price": "₹41,994.00",
    "Key features": "",
    "Connectivity": {
      "Wireless": "Wireless LAN 802.11a/b/g/n/ac (1x1)",
      "Bluetooth Version": "Bluetooth 4.2 M.2",
      "Ethernet": "1000BASE-T Gigabit Ethernet"
    },
    "Main Product Features": {
      "Power Supply": "External 65 W (100V-240V)"
    },
    "Card Support": {
      "Card Reader": "3-in-1 Memory Card Reader"
    },
    "Ports": {
      "LAN port": "Yes",
      "HDMI out": "Yes"
    },
    "Input Output Ports": {
      "Headphone out": "Yes",
      "USB Port": "USB 2.0: 2, USB 3.1: 2"
    },
    "Input Output Devices": {
      "Webcam": "Yes",
      "Keyboard": "HP Wireless Keyboard With Volume Control"
    },
    "Audio Accessories": {
      "Speaker and Microphone": "Internal Speakers"
    },
    "Additional Features": {
      "Other features": "Mother board (Tuscany-R)"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "Optical Drive": {
      "Optical drive": "DVD Writer"
    },
    "General": {
      "Type of Product": "All-in-One Desktop",
      "Model Number": "C0020in",
      "Brand": "HP"
    },
    "Display Features": {
      "Display type": "Widescreen Full High-definition Zbd Ips Anti-glare Wled-backlit Three-sided Borderless Display",
      "Display size": "55.88 cm (22 inch)"
    },
    "Resolution": {
      "Display resolution (pixels)": "1920 x 1080"
    },
    "Product Packaged Dimensions": {
      "Height": "39.07 cm",
      "Width": "49.03 cm",
      "Depth": "1.43 cm"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-22-c0020in-core-i3-8th-gen-all-in-one-desktop-4-gb-1-tb-hdd-55-88-cm-black-/p/214543",
    "description": "Description for HP 22-C0020in Core i3 8th Gen All-in-One Desktop (4 GB, 1 TB HDD, 55.88 cm, Black) Keep up with stringent deadlines by using the HP 22-C0020in All-In-One Desktop which is loaded with fantastic features for your indulgence. It has an amazing storage capacity which lets you store a huge amount of data while the crystal clear 55.88 cm Display and speakers give you a fantastic audio and visual experience. This fantastic desktop is really efficient and will ensure maximum productivity at all times. It runs on a Windows 10 Home operating system and the efficient Intel Core i3-8130U Processor, keeping your productivity levels at their peak. Fantastic Processor Efficiency The 4 GB DDR4 RAM allows you to multitask on different tabs simultaneously for a better user experience. Running on a Windows 10 Home operating system, the laptop comes packed with an Intel Core i3-8130U which never lets you slow down so that the quality and quantity of your work is never compromised because of the CPU speed of 2.2 GHz with max turbo boost of upto 3.4 GHz. Solid Storage Capacity Never run out of space to store a huge amount of workload as the amazing storage capacity helps to keep all data safe for current or future. The HP 22-C0020in All-In-One Desktop comes with a storage capacity of 1 TB HDD which helps you to store your important official data and videos, songs and photos for your leisure while you are on the go. Great Audio-Visual Experience Keep yourself entertained and never miss out on a detail as the HP 22-C0020in All-In-One Desktop gives you a truly enhanced audio and visual experience so that the quality of your entertainment is not compromised. Enjoy watching videos and viewing photos like never before on the 55.88 cm Display and never miss out on a detail."
  },
  {
    "name_small": "HP Pavilion 24-qa156in Core i5 8th Gen Windows 10 Desktop (4 GB + 16 GB Optane, 1 TB HDD, 60.96 cm, Blizzard White)",
    "price": "₹72,994.00",
    "Key features": "",
    "category": "desktops",
    "url": "https://www.croma.com/hp-pavilion-24-qa156in-core-i5-8th-gen-windows-10-desktop-4-gb-+-16-gb-optane-1-tb-hdd-60-96-cm-blizzard-white-/p/214545",
    "description": "Description for HP Pavilion 24-qa156in Core i5 8th Gen Windows 10 Desktop (4 GB + 16 GB Optane, 1 TB HDD, 60.96 cm, Blizzard White) Sit back and enjoy a brilliant entertainment experience on this HP Desktop which is equipped with a powerful Intel Core i5 and 8400T Processor. Feel the future with the all-in-one HP Pavilion 24-qa156in Desktop, and feel the power of the Intel-driven chipset in your day to day work and enjoy lag-free awesome gaming as well. The all-in-one desktop ensures all your official and recreational needs and necessities are taken care of to give you optimum performance levels. The superfast and powerful processor ensures you can multitask between various applications and websites at one go and enjoy a smooth and vibrant computing experience. Cutting-edge Technology The cutting-edge technology of the HP Pavilion 24-qa156in Desktop grabs the attention of all tech savvy people. Finished with specially engineered material that provides this awesome gadget with strength and finesse. The HP Pavilion 24-qa156in Desktop has a sleek design that imparts efficiency, performance along with no extra weight for you to carry. Experience the magic of Windows 10. The desktop is not only equipped with high-end features but with it, you can bring your biggest, boldest ideas to life or multi-task like a master with AMD Radeon 530 Graphics. You can enhance your efficiency with multi-task windows and also connect your Xbox One in an all-new way. The slim bezel and light body compacts performance into one unit built to give you smooth performance with a minimum occupancy of space and weight. Powerful Performance The HP Pavilion 24-qa156in Desktop has been designed to give you uninterrupted performance with the latest cutting-edge technology incorporated into a powerful compact desktop. The powerful processor and the RAM gives you lag-free toggling between applications and games while the RAM space allows you to use the desktop at full function. The HP Pavilion 24-qa156in Desktop has been integrated to give high performance with HD games and the large screen size delivers the full media content of websites, social media and videos for official and casual use."
  },
  {
    "name_small": "HP Pavilion All-in-One-24-qa158in Core i5 8th Gen Windows 10 Desktop (8 GB, 1 TB HDD, 2 GB Graphics, 60.96 cm, White)",
    "price": "₹87,990.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "1 TB"
    },
    "Connectivity": {
      "Wireless": "802.11a/b/g/n/ac (2x2) Wi-Fi",
      "Bluetooth Version": "v4.2 M.2 combo",
      "Memory slot": "2 DIMM"
    },
    "Main Product Features": {
      "Power Supply": "150 W external AC Power Adapter"
    },
    "Input Output Ports": {
      "Audio out": "1 audio-out",
      "USB Interface": "1xUSB 3.1, 1xUSB 3.1 (Battery Charging 1.2), 2xUSB 2.0",
      "LAN Interface": "Integrated 10/100/1000 GbE"
    },
    "Input Output Devices": {
      "Keyboard": "HP White Wireless Keyboard with volume control"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "memory": {
      "ramcapacity": "8 GB DDR4"
    },
    "Dimension and Weigth": {
      "Dimensions": "572 x 170 x 456 mm",
      "Weight (kg)": "7.8"
    },
    "Audio Features": {
      "Audio": "1 audio-in, B&O PLAY"
    },
    "Additional Features": {
      "Other features": "Perfect For (Home), Usage (Everyday Computing), Form Factor (All-in-One), Pre-installed Software (CyberLink Power Media Player), Software Included (McAfee LiveSafe), Cloud Service (Dropbox), Expansion Slots (2 M.2), Pointing Device (HP Wireless White Mouse), Energy Efficiency (Energy Star Certified, Epeat Silver Registered), Security Management (Kensington Lock slot, Firmware TPM 2.0)"
    },
    "Look and Feel": {
      "Colour": "White"
    },
    "Graphics Processor": {
      "Graphics processor brand": "AMD Radeon",
      "Graphics processor": "Discrete, 530 Graphics (2 GB GDDR5 dedicated)"
    },
    "Processor": {
      "Processor name": "Core i5 (8th Gen)",
      "Processor brand": "Intel",
      "Processor speed": "1.7 GHz"
    },
    "Optical Drive": {
      "Optical drive": "DVD-Writer"
    },
    "General": {
      "Type": "Desktop",
      "Model Number": "Pavilion All-in-One-24-qa158in"
    },
    "Display Features": {
      "display": "23.8 Inches diagonal FHD IPS ZBD touch screen (1920 x 1080)",
      "Screen size": "23 Inches-24 Inches (58-61 cm)"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "3 Years"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-pavilion-all-in-one-24-qa158in-core-i5-8th-gen-windows-10-desktop-8-gb-1-tb-hdd-2-gb-graphics-60-96-cm-white-/p/212373",
    "description": "Description for HP Pavilion All-in-One-24-qa158in Core i5 8th Gen Windows 10 Desktop (8 GB, 1 TB HDD, 2 GB Graphics, 60.96 cm, White) Long gone are the days where one had to resort to the large screened heavy processing unit with a lot of wiring connected to have a desktop at home or office. The new innovative generation relies more on the compact and efficient design of computer desktops for homes and official use. The HP Pavilion All-in-One-24-qa158in Desktop presents a self-contained, compact and intricately designed powerful desktop that is designed to impress you with its style and feature. The All-in-One functional options and its powerful processor gives you a cutting-edge benefit while the wire-free design saves on your space and makes your desk look neat and clean. Large HD Display Now watch your favorite show and complete your project for school and college with ease on the HP Pavilion All-in-One-24-qa158in Desktop. Its immersive display is designed to give your high detailing with the images, documents, and even video files. The large display allows you to complete your task and provides ease to your eyes by displaying the documents and files intricately giving you error-free work fast and accurately. The monitor is designed for full HD display and gives your crystal clear quality images and videos making this awesome desktop a high definition screen for watching movies and even playing games Powerful and Compact Design The powerful and compact design of the HP Pavilion All-in-One-24-qa158in Desktop makes it one of the most handy desktops top have at your home or office desk. The hassle-free design eliminated the tension of having multiple wires and setting them up in a messy way. Now just switch on the desktop book your holiday ticket, work on Documents or even watch a movie the powerful processor and its smart wire-free design will help you at every step and ease your task for you. Bring home this powerful desktop and connect to your Xbox consoles and make your desk a gaming battleground."
  },
  {
    "name_small": "HP Pavilion All-in-One-24-qa157in Core i5 8th Gen Windows 10 Desktop (8 GB, 1 TB HDD, 2 GB Graphics, 60.96 cm, White)",
    "price": "₹84,990.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "1 TB"
    },
    "Connectivity": {
      "Wireless": "802.11a/b/g/n/ac (2x2) Wi-Fi",
      "Bluetooth Version": "v4.2 M.2 combo",
      "Memory slot": "2 DIMM"
    },
    "Main Product Features": {
      "Power Supply": "150 W external AC Power Adapter"
    },
    "Input Output Ports": {
      "Audio out": "1 audio-out",
      "USB Interface": "1xUSB 3.1, 1xUSB 3.1 (Battery Charging 1.2), 2xUSB 2.0",
      "LAN Interface": "Integrated 10/100/1000 GbE"
    },
    "Input Output Devices": {
      "Keyboard": "HP White Wireless Keyboard with volume control"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "memory": {
      "ramcapacity": "8 GB DDR4"
    },
    "Dimension and Weigth": {
      "Dimensions": "572 x 170 x 456 mm",
      "Weight (kg)": "7.8"
    },
    "Audio Features": {
      "Audio": "1 audio-in, B&O PLAY"
    },
    "Additional Features": {
      "Other features": "Perfect For (Home), Usage (Everyday Computing), Form Factor (All-in-One), Pre-installed Software (CyberLink Power Media Player), Software Included (McAfee LiveSafe), Cloud Service (Dropbox), Expansion Slots (2 M.2), Pointing Device (HP White Wireless Optical Mouse), Energy Efficiency (Energy Star Certified, Epeat Silver Registered), Security Management (Kensington Security Slot, Firmware TPM 2.0)"
    },
    "Look and Feel": {
      "Colour": "White"
    },
    "Graphics Processor": {
      "Graphics processor brand": "AMD Radeon",
      "Graphics processor": "Discrete, 530 Graphics (2 GB GDDR5 dedicated)"
    },
    "Processor": {
      "Processor name": "Core i5 (8th Gen)",
      "Processor brand": "Intel",
      "Processor speed": "1.7 GHz"
    },
    "Optical Drive": {
      "Optical drive": "DVD-Writer"
    },
    "General": {
      "Type": "Laptop",
      "Model Number": "Pavilion All-in-One-24-qa157in"
    },
    "Display Features": {
      "display": "23.8 Inches diagonal FHD",
      "Screen size": "23 Inches-24 Inches (58-61 cm)"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "3 Years"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-pavilion-all-in-one-24-qa157in-core-i5-8th-gen-windows-10-desktop-8-gb-1-tb-hdd-2-gb-graphics-60-96-cm-white-/p/212372",
    "description": "Description for HP Pavilion All-in-One-24-qa157in Core i5 8th Gen Windows 10 Desktop (8 GB, 1 TB HDD, 2 GB Graphics, 60.96 cm, White) Long gone are the days where one had to resort to the large screened heavy processing unit with a lot of wiring connected to have a desktop at home or office. The new innovative generation relies more on the compact and efficient design of computer desktops for homes and official use. The HP Pavilion All-in-One-24-qa157in Desktop presents a self-contained, compact and intricately designed powerful desktop that is designed to impress you with its style and feature. The All-in-One functional options and its powerful processor gives you a cutting-edge benefit while the wire-free design saves on your space and makes your desk look neat and clean. Large HD Display Now watch your favorite show and complete your project for school and college with ease on the HP Pavilion All-in-One-24-qa157in Desktop. Its immersive display is designed to give your high detailing with the images, documents, and even video files. The large display allows you to complete your task and provides ease to your eyes by displaying the documents and files intricately giving you error-free work fast and accurately. The monitor is designed for full HD display and gives your crystal clear quality images and videos making this awesome desktop a high definition screen for watching movies and even playing games Powerful and Compact Design The powerful and compact design of the HP Pavilion All-in-One-24-qa157in Desktop makes it one of the most handy desktops have at your home or office desk. The hassle-free design eliminated the tension of having multiple wires and setting them up in a messy way. Now just switch on the desktop book your holiday ticket, work on Documents or even watch a movie the powerful processor and its smart wire-free design will help you at every step and ease your task for you. Bring home this powerful desktop and connect to your Xbox consoles and make your desk a gaming battleground."
  },
  {
    "name_small": "Dell Inspiron 3477 Core i3 7th Gen Windows 10 All-in-One Desktop (4 GB, 1 TB, 60.9 cm, Black)",
    "price": "₹49,365.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "1TB 5400RPM SATA 6Gb/s"
    },
    "Connectivity": {
      "Wireless": "802.11ac + Bluetooth 4.1, Dual Band 2.4&5Ghz, 1x1"
    },
    "Application": {
      "Software license": "McAfee Multi Device Security 15 month subscription"
    },
    "Card Support": {
      "Card Reader": "1 3:1 SD Card Reader"
    },
    "Input Output Ports": {
      "Ports": "1 USB 2.0, 3 USB 3.1 Gen 1, 1 Universal Audio Jack, 1 RJ-45 10/100/1000 Ethernet 1 DC power, 1 HDMI-out"
    },
    "Input Output Devices": {
      "Webcam": "Integrated Widescreen HD 720P pop-up Webcam with Single digital microphone",
      "Keyboard": "Dell KM636 Wireless Keyboard and Mouse Black (International English)"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "memory": {
      "System Memory": "4GB RAM, DDR4, 2400MHz"
    },
    "Dimension and Weigth": {
      "Dimensions (H x W x D) (mm)": "358 x 548.8 x 41.5",
      "Weight (kg)": "4.62"
    },
    "Audio Features": {
      "Audio": "Stereo speakers professionally tuned with Waves Maxx Audio Pro"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "Graphics Processor": {
      "Graphics processor": "Intel HD graphics 620 with shared graphics memory"
    },
    "Processor": {
      "processor": "Powered by 7th Generation Intel Core i3-7130U Processor"
    },
    "Optical Drive": {
      "Optical drive": "Internal Optical Drive Not Included"
    },
    "General": {
      "Type of Product": "Desktop",
      "Model Number": "Inspiron-24-3477"
    },
    "Display Features": {
      "Screen size": "24 inch",
      "Display size": "60.9 cm"
    },
    "Resolution": {
      "Screen Resolution": "1920 x 1080"
    },
    "Power": {
      "Power": "45 Watt AC Adaptor, 65 Watt AC Adaptor"
    },
    "After Sales Service": {
      "Manufacturer Warranty": "1 Year Ltd Hardware Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/dell-inspiron-3477-core-i3-7th-gen-windows-10-all-in-one-desktop-4-gb-1-tb-60-9-cm-black-/p/212005",
    "description": "Description for Dell Inspiron 3477 Core i3 7th Gen Windows 10 All-in-One Desktop (4 GB, 1 TB, 60.9 cm, Black) OverviewThe Dell 3477 All-in-One Desktop is the ideal computer for home and office use. It combines power, graphics and an advanced processor to get you through the day without any hassle. Expect the best computing power, greater flexibility and value for your money with this computer. This desktop is a streamlined, self-contained computer with all the circuitry built into a larger display. It comes equipped with an integrated webcam and Wi-Fi connectivity and also easier to set up than a traditional desktop. The All-in-One desktop comes with a keyboard, mice and a touch display to ensure the best performance. Gone are the days when traditional desktop computers occupied ample space and there were the plethora of wires that had to be connected to get you going. With the introduction of All-in-One desktop computers, it has now become easier to work with maximum efficiency and productivity.  Entertainment Redefined The Dell 3477 All-in-One Desktop has redefined the entertainment experience by giving you a personal theatre like experience. Dell cinema equips your computer with incredible sound and streaming. Studio-quality sound is experienced with Wave Maxx Audio Pro boost technology which delivers excellent sound thereby completing your immersive experience. It is so advanced that it automatically tunes your audio with clearer highs, enhanced bass and increased volume so everything you hear sounds exactly the way it was meant to. Additionally, the computer also features SmartByte technology that allows superior streaming and interactive video experience. The SmartByte technology also ensures that your most important applications get the required bandwidth for optimal performance. So now you can effortlessly watch your favourite TV shows on Netflix or stream videos on YouTube.  Immersive Display The Dell 3477 All-in-One Desktop possesses an immersive display. Enjoy watching brightest cartoons to the darkest dramas on this 24-inch Full HD display with narrow bezel border. The IPS wide-viewing-angle display lets you watch TV shows, movies and play games from any angle you want. An interactive experience is possible with the edge-to-edge touchscreen display. The integrated graphics card lets you multi-task with ease and helps you toggle between multiple windows quickly.  Performance, Storage, and Connectivity The Dell 3477 All-in-One Desktop comes with the latest 7th generation i3 processor that makes multi-tasking a breeze. It comes with great performance and gives you the flexibility to work however you want. The 64-bit operating system is integrated with the computer that gives a larger quantity of available memory in theory thereby allowing you to install advanced software. It also comes equipped with a 4gb DDR4 RAM that boosts your computer speed and lets you multitask quickly. You can easily run multiple applications on your computer thereby completing your work and saving time. The 1TB Hard Drive gives ample space to store all your important files, documents, videos, pictures and movies. The large storage space ensures you do not run out of disk space and never worry about saving big files. The computer also comes equipped with connectivity options such as 1 USB 2.0 port, 3 USB 3.1 ports, 1 Universal Audio Jack, 1 RJ 45 10/100/ 1000 and 1 HDMI port. With great connectivity options, you can transfer data to your computer or connect it to a projector or TV screen for the enhanced viewing experience."
  },
  {
    "name_small": "Dell Inspiron 3477 Core i5 7th Gen Windows 10 All-in-One Desktop (4 GB,1 TB, 60.9 cm, Black)",
    "price": "₹62,990.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "1TB 5400RPM SATA 6Gb/s"
    },
    "Connectivity": {
      "Wireless": "802.11ac + Bluetooth 4.1, Dual Band 2.4&5Ghz, 1x1"
    },
    "Application": {
      "Software license": "McAfee Multi Device Security 15 month subscription"
    },
    "Card Support": {
      "Card Reader": "1 3:1 SD Card Reader"
    },
    "Input Output Ports": {
      "Ports": "1 USB 2.0, 3 USB 3.1 Gen 1, 1 Universal Audio Jack, 1 RJ-45 10/100/1000 Ethernet, 1 DC power, 1 HDMI-out"
    },
    "Input Output Devices": {
      "Webcam": "Integrated Widescreen HD 720P pop-up Webcam with Single digital microphone",
      "Keyboard": "Dell KM636 Wireless Keyboard and Mouse Black (International English)"
    },
    "Operating System": {
      "Operating System": "Windows 10 Home Single Language, English"
    },
    "memory": {
      "System Memory": "4GB RAM, DDR4, 2400MHz"
    },
    "Dimension and Weigth": {
      "Dimensions (H x W x D) (mm)": "358 x  548.8 x  548.8",
      "Weight (kg)": "4.62"
    },
    "Audio Features": {
      "Audio": "Stereo speakers professionally tuned with Waves MaxxAudio Pro"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "Graphics Processor": {
      "Graphics processor": "Intel HD graphics 620 with shared graphics memory"
    },
    "Processor": {
      "processor": "7th Generation Intel Core i5-7200U Processor (3M Cache, up to 3.10 GHz)"
    },
    "Optical Drive": {
      "Optical drive": "Internal Optical Drive Not Included"
    },
    "General": {
      "Type of Product": "Desktop",
      "Model Number": "Inspiron 3477"
    },
    "Display Features": {
      "Screen size": "24 inch",
      "Display size": "60.9 cm"
    },
    "Power": {
      "Power": "45 Watt AC Adaptor, 65 Watt AC Adaptor"
    },
    "After Sales Service": {
      "Manufacturer Warranty": "3 Year Ltd Hardware Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/dell-inspiron-3477-core-i5-7th-gen-windows-10-all-in-one-desktop-4-gb-1-tb-60-9-cm-black-/p/212007",
    "description": "Description for Dell Inspiron 3477 Core i5 7th Gen Windows 10 All-in-One Desktop (4 GB,1 TB, 60.9 cm, Black) OverviewThe Dell 3477 All-in-One Desktop is the ideal computer for home and office use. It combines power, graphics and an advanced processor to get you through the day without any hassle. Expect the best computing power, greater flexibility and value for your money with this computer. This desktop is a streamlined, self-contained computer with all the circuitry built into a larger display. It comes equipped with an integrated webcam and Wi-Fi connectivity and also easier to set up than a traditional desktop. The All-in-One desktop comes with a keyboard, mice and a touch display to ensure the best performance. Gone are the days when traditional desktop computers occupied ample space and there were a plethora of wires that had to be connected to get you going. With the introduction of All-in-One desktop computers, it has now become easier to work with maximum efficiency and productivity.  Entertainment Redefined The Dell 3477 All-in-One Desktop has redefined the entertainment experience by giving you a personal theatre like experience. Dell cinema equips your computer with incredible sound and streaming. Studio-quality sound is experienced with Wave Maxx Audio Pro boost technology which delivers excellent sound thereby completing your immersive experience. It is so advanced that it automatically tunes your audio with clearer highs, enhanced bass, and increased volume so everything you hear sounds exactly the way it was meant to. Additionally, the computer also features SmartByte technology that allows superior streaming and interactive video experience. The SmartByte technology also ensures that your most important applications get the required bandwidth for optimal performance. So now you can effortlessly watch your favourite TV shows on Netflix or stream videos on YouTube.  Immersive Display The Dell 3477 All-in-One Desktop possesses an immersive display. Enjoy watching brightest cartoons to the darkest dramas on this 24-inch Full HD display with narrow bezel border. The IPS wide-viewing-angle display lets you watch TV shows, movies and play games from any angle you want. An interactive experience is possible with the edge-to-edge touchscreen display. The integrated graphics card lets you multi-task with ease and helps you toggle between multiple windows quickly.  Performance, Storage, and Connectivity The Dell 3477 All-in-One Desktop comes with the latest 7th generation i5 processor that makes multi-tasking a breeze. It comes with great performance and gives you the flexibility to work however you want. The 64-bit operating system is integrated with the computer that gives a larger quantity of available memory in theory thereby allowing you to install advanced software. It also comes equipped with a 4gb DDR4 RAM that boosts your computer speed and lets you multitask quickly. You can easily run multiple applications on your computer thereby completing your work and saving time. The 1TB Hard Drive gives ample space to store all your important files, documents, videos, pictures and movies. The large storage space ensures you do not run out of disk space and never worry about saving big files. The computer also comes equipped with connectivity options such as 1 USB 2.0 port, 3 USB 3.1 ports, 1 Universal Audio Jack, 1 RJ 45 10/100/ 1000 and 1 HDMI port. With great connectivity options, you can transfer data to your computer or connect it to a projector or TV screen for the enhanced viewing experience."
  },
  {
    "name_small": "",
    "price": "",
    "Key features": "",
    "category": "desktops",
    "url": "https://www.croma.com/hp-all-in-one-20-c419in-windows-10-desktop-4-gb-1-tb-hdd-49-53-cm-white-/p/211916",
    "description": ""
  },
  {
    "name_small": "Lenovo IdeaCentre 520 Core i5 7th Gen Windows 10 Desktop (8 GB, 2 TB HDD, 60.24 cm, Black)",
    "price": "₹76,990.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "2 TB"
    },
    "Connectivity": {
      "Wireless": "802.11 AC",
      "HDMI Interface": "1xHDMI In/Out port",
      "Bluetooth Version": "v4.0"
    },
    "Main Product Features": {
      "Power Supply": "120W Adapter"
    },
    "Card Support": {
      "Card Reader": "3-in-1 Card Reader (Bottom) (SD, SDHC, SDXC)"
    },
    "Input Output Ports": {
      "USB Interface": "3 x USB 2.0, 2 x USB 3.0"
    },
    "Input Output Devices": {
      "Webcam": "IR Camera"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "memory": {
      "ramcapacity": "8 GB DDR4"
    },
    "Dimension and Weigth": {
      "Weight (kg)": "6.17"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "Processor": {
      "Processor variant": "7400T",
      "Processor name": "Core i5 (7th Gen)",
      "Processor brand": "Intel"
    },
    "Optical Drive": {
      "Optical drive": "Slim DVD Rambo 9MM"
    },
    "General": {
      "Type": "Desktop",
      "Model Number": "IdeaCentre 520"
    },
    "Display Features": {
      "display": "23.8 Inches FHD Multi Touch Borderless",
      "Touch Screen": "Yes"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "3 Years"
    },
    "category": "desktops",
    "url": "https://www.croma.com/lenovo-ideacentre-520-core-i5-7th-gen-windows-10-desktop-8-gb-2-tb-hdd-60-24-cm-black-/p/210030",
    "description": "Description for Lenovo IdeaCentre 520 Core i5 7th Gen Windows 10 Desktop (8 GB, 2 TB HDD, 60.24 cm, Black) Long gone are the days where one had to resort to large screened heavy processing unit with a lot of wiring connected to have a desktop at home or office. The new innovative generation relies more on compact and efficient design of computer desktops for homes and official use. The Lenovo IdeaCentre 520 Desktop presents a self-contained, compact and intricately designed powerful desktop that is designed to impress you with its style and feature. The All-in-One functional options and its powerful processor gives you a cutting edge benefit while the wire-free design saves on your space and makes your desk look neat and clean. Compact Design The powerful and compact design of the Lenovo IdeaCentre 520 Desktop makes it one of the most handy desktops top have at your home or office desk. The hassle free design eliminated the tension of having multiple wires and setting them up in a messy way. Now just switch on the desktop book your holiday ticket, work on documents or even watch a movie the powerful processor and its smart wire free design will help you at every step and ease your task for you. Bring home this powerful desktop and watch the movie of your choice in high resolution packed with thrill. Multi-Touch Borderless Display Now watch your favourite show and complete your project for school and college with ease on the Lenovo IdeaCentre 520 Desktop. Its immersive display is designed to give your high detailing with the images, documents and even video files. The large display allows you to complete your task and provides ease to your eyes by displaying the documents and files intricately giving you error free work fast and accurately. The monitor is designed for full HD display and gives your crystal clear quality images and videos making this awesome desktop a high definition screen for watching movies and even playing games"
  },
  {
    "name_small": "HP 260-a112in Pentium Windows 10 Desktop (4 GB, 500 GB HDD, Black)",
    "price": "₹25,994.00",
    "Key features": "",
    "Storage Capacity": {
      "Hard disk capacity": "500 GB"
    },
    "Connectivity": {
      "Wireless": "802.11b/g/n (1x1)",
      "HDMI Interface": "1 x HDMI-out 1.4",
      "Bluetooth": "Bluetooth 4.0 combo",
      "Bluetooth Version": "v4.0",
      "Ethernet": "Integrated 10/100/1000 Gigabit Ethernet LAN",
      "Memory slot": "1 x 4 GB"
    },
    "Main Product Features": {
      "Key features": "DTS Studio Sound, USB black keyboard, USB optical mouse"
    },
    "Ports": {
      "LAN Interface": "RJ-45",
      "VGA Interface": "1 x VGA"
    },
    "Input Output Ports": {
      "USB Interface": "4 x USB 2.0, 2 x USB 3.0"
    },
    "Operating System": {
      "Operating System": "Windows 10 Home 64"
    },
    "memory": {
      "System Memory": "4 GB",
      "Memory card slot": "1 x M.2"
    },
    "Dimension and Weigth": {
      "Dimensions": "307 x 100 x 275 mm"
    },
    "Colour Option": {
      "Colour option": "Black"
    },
    "Graphics Processor": {
      "Graphics processor brand": "Intel",
      "Integrated graphics processor (Yes / No)": "Yes",
      "Graphics processor": "HD Graphics"
    },
    "Processor": {
      "Processor name": "Pentium",
      "Processor brand": "Intel",
      "Processor speed": "1.6 GHz"
    },
    "Optical Drive": {
      "Optical drive": "DVD-Writer"
    },
    "Performance": {
      "Hard disk speed (rpm)": "7200"
    },
    "General": {
      "Model Number": "260-a112in"
    },
    "Power": {
      "Power Supply": "65 W AC power adapter"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "1 year limited parts, labour and on-site service, toll-free technical phone support for the first 30 days"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-260-a112in-pentium-windows-10-desktop-4-gb-500-gb-hdd-black-/p/208833",
    "description": "Description for HP 260-a112in Pentium Windows 10 Desktop (4 GB, 500 GB HDD, Black) Begin your journey to the top with the stylish and performance packed HP Desktop - 260-a102in and make sure you never miss out on a detail even while you are on the go. The cutting edge technology makes it an ideal companion for you to counter any challenges you need to overcome and adds to your efficiency level. The windows 10 operating system and the Intel Pentium Processor makes you ready to face any work challenges so that you are never lagging behind in life in the fast lane. An amazing storage capacity lets you store a huge amount of data while the various connectivity options add another dimension to your computing experience. Brilliant Processor Performance Your computing experience is sure to be taken to another level as the Intel Pentium Quad Core Processor never lets you slow down so that the quality and quantity of your work is never compromised. The Intel HD graphics give you an excellent gaming experience and are sure to let your experience a visual delight on your screen and lets you take on any activity without any sort of hindrance. The 4 GB RAM makes sure you can multitask between different tabs easily for an amazing user experience. Solid Storage Capacity With the huge amount of workload and data involved in today’s world, it may get difficult at times to keep all data safe for current or future use stored due to average storage capacities. The HP Desktop - 260-a102in comes with a serious storage capacity which helps you to save and carry your contents wherever you go. The 500 GB HDD makes you overcome the fear of running out of storage space and lets you store your important official data and videos, songs and photos for your leisure while you are on the go. Connectivity Options Apart from all its essential and efficient inbuilt features, the HP Desktop - 260-a102in comes with multiple connectivity option to expand your possibilities. The desktop comes with a HDMI port, 4 USB 2.0, 2 USB 3.0 WHICH allows you to have access to entertainment in different ways and helps to increase your options for maximum productivity. The ports are also strategically placed to give you easy access and usage for them."
  },
  {
    "name_small": "HP 19ka 18.5 Inch Monitor (Black)",
    "price": "₹5,690.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Dimensions": "441 x 198.42 x 344.9 mm (With Stand), 441 x 48.2 x 285.4 mm (Without Stand)",
      "Weight (kg)": "1.98 (Without Stand)"
    },
    "Ports": {
      "VGA": "1 (Input Connector)",
      "VGA Interface": "Yes"
    },
    "Additional Features": {
      "Other features": "LED backlighting, Value Displays, Tilt (-5), Swivel Angle (+20), 0.3 mm Pixel Pitch, Onscreen Controls : Brightness, Contrast, Color Control, Image Control, Power, Menu, Management, Information, Exit, Up To 16.7 Million Colors Supported (Through FRC Technology), Display Scan Frequency : Up To 75 Hz (Vertical), Up To 70 kHz (Horizontal), Security Lock - Ready (lock is sold separately), Colour : Black"
    },
    "Display Features": {
      "display": "409.8 x 230.4 mm (Area, Imperial)",
      "Contrast ratio": "600 : 1 (Static), 6000000 : 1 (Dynamic)",
      "Display Features": "Anti - Glare, Language Selection, LED Backlights, On - Screen Controls, Plug And Play, User Programmable",
      "Display size": "469.9 mm (18.5), Diagonal"
    },
    "Resolution": {
      "Resolution": "1366 x 768 (HD)"
    },
    "Image Features": {
      "Aspect ratio": "16 : 9"
    },
    "Response Time": {
      "Response time": "7 ms On / Off"
    },
    "Suggested Usage": {
      "Usage": "Cost Conscious, Everyday User, Home"
    },
    "General": {
      "Model Number": "19ka"
    },
    "Compatibility": {
      "Compatible screen size": "18.5 Inches"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-19ka-18-5-inch-monitor-black-/p/208831",
    "description": "Description for HP 19ka 18.5 Inch Monitor (Black) You can now experience your work and entertainment on the big screen thanks to the stunning and feature packed HP 19ka Monitor that gives you a display exuding bright colours and vivid images so that you never miss a single moment. The monitor which has a size of 18.5-inches brings to life colours on your screen that are indistinguishable from real life to give you a totally immersive experience while the energy star certification ensures that you can enjoy the stunning visuals without excessive energy consumption. The monitor provides you with full high definition visuals to ensure you never miss a detail – be it work or entertainment. The stunning visuals are backed by a sleek design to make the monitor the perfect computing option for you. Stunning Picture Quality Be sure of never missing a detail on your screen as the HP 19ka Monitor comes packed with cutting edge features that make it the ultimate viewing option for you. The monitor helps to deliver ultra-wide viewing angles and vivid 1366x768 resolution to give you an expansive entertainment experience. The monitor which is designed with a mercury-free backlight and arsenic free glass boasts of an energy star rating certification that helps reduce power consumption to save on costs. The 6M:1 dynamic contrast ratio ensures you enjoy crisp visuals for a truly breathtaking experience. Premium Design The HP 19ka Monitor not only gives you an immersive viewing experience but also boats of a stunning design that looks great on your desk. The compact size has strategically designed ports to ensure simple and easy access to all your ports for a more convenient experience while the clutter free design makes it a very convenient option to have."
  },
  {
    "name_small": "HP AIO Pav 20-q308in 7Gi3 4GBN + Off",
    "price": "₹41,444.00",
    "Key features": "",
    "category": "desktops",
    "url": "https://www.croma.com/hp-aio-pav-20-q308in-7gi3-4gbn-+-off/p/207955",
    "description": "Description for HP AIO Pav 20-q308in 7Gi3 4GBN + Off Explore the world of limitless possibilities with the power packed and stylish HP All-in-One  20-q308in Desktop and never miss out on anything that would hold you back. The stunning 19.5-inch FHD display along with its powerful 7th Generation Intel Core i3 Processor makes it an attractive proposition for you at all times for an amazing computing experience. You can also enjoy watching movies, hearing songs, chatting with your friends while you do your official work as the 4 GB RAM gives you a performance boost and allows you to multitask easily without any hiccups. The performance of the desktop is brilliantly complimented by the stylish design and sleek finish which makes it an ideal proposition and a must have for your daily needs. Power Packed Performance The 7th Generation Intel Core i3 processor that comes with a blazing processor speed never lets you slow down so that the quality and quantity of your work is never compromised. The 4 GB RAM makes sure you can multitask between different tabs easily for an amazing user experience. The Intel HD Graphics 620 further boost your gaming experience for a glitch free performance. Solid Storage Capacity With the huge amount of workload and data involved in today’s world, it may get difficult at times to keep all data safe for current or future use stored due to average storage capacities. The HP All-in-One 20-q308in Desktop comes with a serious storage capacity which helps you to save and carry your contents wherever you go. The 1 TB HDD makes you overcome the fear of running out of storage space and lets you store your important official data and videos, songs and photos for your leisure while you are on the go. An Immersive Visual Experience Keep yourself entertained and enjoy and immersive experience as the HP All-in-One  20-q308in Desktop gives you a truly enhanced audio and visual experience and does not compromise with the quality of your entertainment. Enjoy watching videos and viewing photos like never before with the 19.5 inch FHD Anti-Glare Widescreen LED Display which ensures you never miss out on a detail whether it is work or entertainment. The integrated stereo speakers with DTS studio sound give the images life and allows you to enjoy breathtaking entertainment. The integrated webcam with built-in microphone makes for a truly enhanced video calling experience."
  },
  {
    "name_small": "Lenovo AIO 310 7VIN Pentium Windows 10 Desktop (4 GB, 1 TB HDD, 49.53 cm, Black)",
    "price": "₹26,994.00",
    "Key features": "",
    "Connectivity": {
      "Bluetooth Version": "4",
      "Wi-Fi": "802.11AC",
      "USB": "1 x USB 3.0, 2 x USB 2.0"
    },
    "Ports": {
      "HDMI": "Yes"
    },
    "Input Output Devices": {
      "Webcam": "720P"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "memory": {
      "ramcapacity": "4 GB",
      "Memory card slot": "3 in 1 Card-Reader"
    },
    "Dimension and Weigth": {
      "Weight (kg)": "4.3"
    },
    "Processor": {
      "Processor variant": "J4205",
      "Processor name": "Pentium",
      "Processor brand": "Intel"
    },
    "Optical Drive": {
      "Optical drive": "Slim DVD RW"
    },
    "General": {
      "Model Number": "AIO 310",
      "Type": "All In One Desktop"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "1 Year On-Site Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/lenovo-aio-310-7vin-pentium-windows-10-desktop-4-gb-1-tb-hdd-49-53-cm-black-/p/207895",
    "description": "Description for Lenovo AIO 310 7VIN Pentium Windows 10 Desktop (4 GB, 1 TB HDD, 49.53 cm, Black) Complete all your personal and professionals tasks online seamlessly with the slim, stylish, and simple to use Lenovo IdeaCentre AIO 310 Desktop that is sure to mesmerize your senses with its stunning visuals and performance levels. The windows 10 Home operating system and the efficient Intel Pentium Processor makes you ready to face any work challenges so that you are never lagging behind in life in the fast lane. An amazing storage capacity lets you store a huge amount of data while the crystal clear 19.5 inch high definition display give you an overwhelming visual experience. The specially designed optional keyboard with 3mm spacing between each key helps in accurate typing. The stylish design compliments the brilliant features and makes it an ideal proposition for you. Efficient Performance Your computing experience is sure to be taken to a whole new level as the amazing desktop comes with an efficient Intel Celeron J3355 Processor that comes with a 2.00GHz 2000MHz processor speed that never lets you slow down so that the quality and quantity of your work is never compromised and lets you take on any activity without any sort of hindrance. The Integrated Graphics ensure that you enjoy stunning visuals and amazing gameplay without any glitches. The 4 GB RAM makes sure you can multitask between different tabs easily for an amazing user experience. Stunning Audio And Visuals Keep yourself entertained and enjoy an immersive experience as the Lenovo IdeaCentre AIO 310 Desktop gives you a truly enhanced audio and visual experience and does not compromise with the quality of your entertainment. Enjoy watching videos and viewing photos like never before with the 19.5 inch HD display which ensures never miss out on a detail whether it is work or entertainment. You can also enjoy a sublime video calling experience thanks to the 720p HD camera with microphone. The front facing integrated 2W stereo speakers take the visuals to a whole new level with breathtaking sound output. Storage Capacity With the huge amount of workload and data involved in today’s world, it may get difficult at times to keep all data safe for current or future use stored due to average storage capacities. The Lenovo IdeaCentre AIO 310 Desktop comes with a serious storage capacity which helps you to save and carry your contents wherever you go. The 1 TB HDD makes you overcome the fear of running out of storage space and lets you store your important official data and videos, songs and photos for your leisure. The amazing storage can hold an average of up to 1000 movies, 30,000 songs or 40,000 photos so that you are just one click away from all of them."
  },
  {
    "name_small": "Dell AIO 3064 Core i3 7th Gen Windows 10 Desktop (4 GB, 1 TB HDD, 49.53 cm, Black)",
    "price": "₹44,168.00",
    "Key features": "",
    "category": "desktops",
    "url": "https://www.croma.com/dell-aio-3064-core-i3-7th-gen-windows-10-desktop-4-gb-1-tb-hdd-49-53-cm-black-/p/205998",
    "description": "Description for Dell AIO 3064 Core i3 7th Gen Windows 10 Desktop (4 GB, 1 TB HDD, 49.53 cm, Black) Begin your journey to the top with the stylish and performance packed Dell New Inspiron All-in-One Desktop and make sure you never miss out on a detail even while you are on the go. The cutting edge technology makes it an ideal companion for you to counter any challenges you need to overcome and adds to your efficiency level. The windows 10 Home operating system and the efficient 7th Generation Intel Core i3 processor makes you ready to face any work challenges so that you are never lagging behind in life in the fast lane. An amazing storage capacity of 1 TB lets you store a huge amount of data while the crystal clear 19.5 inch HD+ display with a 1600 x 900 resolution and built-in stereo speakers tuned with Waves MaxxAudio give you an overwhelming audio and visual experience. The stylish design compliments the brilliant features and makes it an ideal proposition for you. Brilliant Processor Performance The 7th Generation Intel Core i3 Processor never lets you slow down so that the quality and quantity of your work is never compromised. The Intel HD graphics give you an excellent gaming experience and are sure to let your experience a visual delight on your screen and lets you take on any activity without any sort of hindrance. The 4 GB RAM makes sure you can multitask between different tabs easily for an amazing user experience. An Immersive Audio And Visual Experience Keep yourself entertained and enjoy and immersive experience as the Dell New Inspiron All-in-One desktop gives you a truly enhanced audio and visual experience and does not compromise with the quality of your entertainment. Enjoy watching videos and viewing photos like never before with the 19.5 inch HD+ display with a 1600 x 900 resolution which ensures you never miss out on a detail. The built-in stereo speakers tuned with Waves MaxxAudio offer crystal clear audio for a distortion free audio experience. The Integrated Widescreen HD 720P Webcam with Single digital microphone enhances your video calling experience and makes you feel closer to your loved ones. Solid Storage Capacity With the huge amount of workload and data involved in today’s world, it may get difficult at times to keep all data safe for current or future use stored due to average storage capacities. The Dell New Inspiron All-in-One Desktop comes with a serious storage capacity which helps you to save and carry your contents wherever you go. The 1 TB HDD makes you overcome the fear of running out of storage space and lets you store your important official data and videos, songs and photos for your leisure while you are on the go."
  },
  {
    "name_small": "Dell Inspiron 3052 Pentium Windows 10 AiO Desktop (4 GB, 1 TB HDD, 49.53 cm, Black)",
    "price": "₹34,678.00",
    "Key features": "",
    "category": "desktops",
    "url": "https://www.croma.com/dell-inspiron-3052-pentium-windows-10-aio-desktop-4-gb-1-tb-hdd-49-53-cm-black-/p/205997",
    "description": "Description for Dell Inspiron 3052 Pentium Windows 10 AiO Desktop (4 GB, 1 TB HDD, 49.53 cm, Black) Explore the world of limitless possibilities with the power packed and stylish Dell New Inspiron All-in-One Desktop and never miss out on anything that would hold you back. The stunning visual 49.5cm (19.5) HD+ display along with its powerful Intel Pentium Processor J3710 makes it an attractive proposition for you even while you are on the move. You can also enjoy watching movies, hearing songs, chatting with your friends while you do your official work as the 4 GB RAM gives you a performance boost and allows you to multitask easily without any hiccups. The performance of the desktop is brilliantly complimented by the stylish design and sleek finish which makes it an ideal proposition and a must have for your daily needs. Solid Storage Capacity With the huge amount of workload and data involved in today’s world, it may get difficult at times to keep all data safe for current or future use stored due to average storage capacities. The Dell New Inspiron All-in-One Desktop comes with a serious storage capacity which helps you to save and carry your contents wherever you go. The 1TB HDD makes you overcome the fear of running out of storage space and lets you store your important official data and videos, songs and photos for your leisure while you are on the go. Brilliant Processor Performance The Intel Pentium Processor J3710 never lets you slow down so that the quality and quantity of your work is never compromised. The Intel HD graphics give you an excellent gaming experience and are sure to let your experience a visual delight on your screen and lets you take on any activity without any sort of hindrance. The 4 GB RAM makes sure you can multitask between different tabs easily for an amazing user experience. An Immersive Audio And Visual Experience Keep yourself entertained and enjoy and immersive experience as the Dell New Inspiron All-in-One desktop gives you a truly enhanced audio and visual experience and does not compromise with the quality of your entertainment. Enjoy watching videos and viewing photos like never before with the 19.5 inch HD+ display which ensures you never miss out on a detail. The built-in stereo speakers tuned with Waves MaxxAudio offer crystal clear audio for a distortion free audio experience. The Integrated Widescreen HD Webcam enhances your video calling experience and makes you feel closer to your loved ones."
  },
  {
    "name_small": "Apple iMac MMQA2HN/A 54.61cm MacOS Sierra (Intel Core i5, 8GB, 1TB HDD)",
    "price": "₹92,907.00",
    "Key features": "",
    "Connectivity": {
      "Wireless": "802.11ac Wi-Fi wireless networking IEEE 802.11a/b/g/n compatible",
      "HDMI Interface": "Yes",
      "Bluetooth": "V4.2",
      "Ethernet": "10/100/1000BASE-T Gigabit Ethernet (RJ-45 connector)"
    },
    "Ports": {
      "VGA Interface": "Yes"
    },
    "Input Output Ports": {
      "Mic-In": "Yes",
      "USB Interface": "4 x USB 3.0/ 2 x Thunderbolt 3 (USB-C)"
    },
    "Speaker Features": {
      "Speaker": "Stereo speakers"
    },
    "Input Output Devices": {
      "Webcam": "FaceTime HD camera"
    },
    "Operating System": {
      "Operating System": "MacOS Sierra"
    },
    "memory": {
      "System Memory": "8 GB"
    },
    "Dimension and Weigth": {
      "Weight (kg)": "5.66"
    },
    "Graphics Processor": {
      "Graphics processor": "Intel Iris Plus Graphics 640"
    },
    "Processor": {
      "Processor name": "Intel Core i5",
      "Processor brand": "Intel"
    },
    "Display Features": {
      "Monitor type": "LED-backlit Display",
      "Monitor size (inches)": "21.5"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "1 Year Limited Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/apple-imac-mmqa2hn-a-54-61cm-macos-sierra-intel-core-i5-8gb-1tb-hdd-/p/203831",
    "description": "Description for Apple iMac MMQA2HN/A 54.61cm MacOS Sierra (Intel Core i5, 8GB, 1TB HDD) If you have been looking for a compact desktop system that promises a consistent and powerful performance, then the Apple iMac 21.5-inch Desktop System is going to be the best option for you. This one device is equipped with high-end hardware and software support to allow you to discover more of the computing world. Display and Processor The Apple iMac 21.5-inch Desktop System features a 21.5-inch display which ensures a clear picture quality. The 1920 x 1080 resolution with support for one billion colours reproduces impressive images which ensure to give you an excellent visual experience. Powered by the 2.3GHz quad-core Intel Core i5 (Turbo Boost up to 3.6GHz) processor allows smooth and lag-free operation. Now, when it comes to enhanced image and video quality, this desktop system comes with the Intel Iris Plus Graphics 640 which produces excellent graphics and makes each image clear with perfect contrast. Operating System and Storage Equipped with the advanced macOS Sierra, which powers the system and is responsible for smooth functioning of the Apple iMac 21.5-inch Desktop System, allows you to work without a hassle. This excellent operating system manages computer resources very efficiently. It also establishes an impressive user interface and ensures swift operation. This desktop is designed to store all your files and data in organised manners as it features a huge memory. It comes with 8GB DDR4 onboard memory and 1 TB Hard Drive which offers you an ample amount of space to store huge amount of data. Additional Functions Equipped with 802.11ac Wi-Fi wireless networking and 4.2 Bluetooth connectivity, this desktop has all the advanced features to keep you connected to the rest of the world. It also offers a wide range of connectivity as it comes with the Thunderbolt 2, HDMI, DVI, and VGA output supports. These also result in impressive video quality. It comes with stereo speakers, microphone and 3.5mm headphone jack which provide high-quality audio output. Featuring an excellent FaceTime HD camera, the Apple iMac 21.5-inch Desktop System makes video calling effective. The desktop features Thunderbolt 3 digital video output along with Native Display port output over USB-C. You can play high definition games or do your office work with equally impressive speed with this Apple iMac 21.5-inch Desktop System desktop system."
  },
  {
    "name_small": "Dell Inspiron One 24 3464 60.45cm Windows 10 (Intel Core i5, 8GB, 1TB HDD)",
    "price": "₹69,994.00",
    "Key features": "",
    "Connectivity": {
      "Wireless": "802.11ac",
      "HDMI Interface": "1 Port",
      "Bluetooth": "v4.0",
      "Ethernet": "Yes"
    },
    "Input Output Ports": {
      "Mic-In": "Yes",
      "USB Interface": "2 x USB 2.0/ 2 x USB 3.0",
      "LAN Interface": "RJ-45"
    },
    "Speaker Features": {
      "Speaker": "Stereo speakers professionally tuned with Waves MaxxAudio"
    },
    "Input Output Devices": {
      "Webcam": "Integrated Widescreen HD 720P Webcam"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "Speed": {
      "speed": "3.10 GHz"
    },
    "memory": {
      "System Memory": "8 GB",
      "Memory card slot": "Yes"
    },
    "Colour Option": {
      "Colour option": "Black"
    },
    "Graphics Processor": {
      "Graphics processor": "NVIDIA GeForce 920MX with 2GB GDDR5"
    },
    "Processor": {
      "Processor variant": "7200U",
      "Processor name": "Intel Core i5",
      "Processor brand": "Intel"
    },
    "Optical Drive": {
      "Optical drive": "Tray load DVD Drive (Reads and Writes to DVD/CD)"
    },
    "Performance": {
      "Hard disk speed": "5400 RPM"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "1 Year Limited Hardware Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/dell-inspiron-one-24-3464-60-45cm-windows-10-intel-core-i5-8gb-1tb-hdd-/p/203635",
    "description": "Description for Dell Inspiron One 24 3464 60.45cm Windows 10 (Intel Core i5, 8GB, 1TB HDD) Dell AIO 3464 7Gi5 desktop will be your perfect companion when it comes to daily computing needs. Infused with high-grade processor and choice hardware, it assures you with an exceptional performance. Besides, it comes with a high battery life which renders it durable in the long run. Vivid Display Dell AIO 3464 7Gi5 desktop has been designed in a manner to fit your contemporary image, this desktop is very light in weight. The display features an IPS screen that is 23.8 inches wide. Besides, it is equipped with a resolution of 1920 x 1080 pixels, making your work documents come alive in Full HD. This wide view angle screen is infused with such technology so as to produce a wide view, so that you may work at your own comfort. Equipped with NVIDIA GeForce 920MX, it offers you with a smooth gaming experience. Memory And Processor The Dell AIO 3464 7Gi5 desktop performs brilliantly as it has been powered by seventh generation Intel Core i5 7200U processor. Besides, it comes preloaded with Windows 10 Home and student operating system which ensures efficient execution of your commands. It is enabled with card reader supporting multiple formats, which is highly advantageous. The desktop comes with a decent internal storage capacity of 1 TB HDD, the desktop makes space for your work or entertainment files. In addition, it comes with 8 GB RAM backup which allows you to edit videos in great perfection, especially if you are a professional. Salient Features Dell AIO 3464 7Gi5 desktop is also powered by a highly efficient battery, this desktop is energy efficient and comes with a long life. It also features an integrated widescreen HD 720p webcam with single digital microphone and stereo speakers that has been professionally tuned with Waves Maxx Audio in order to bring to you ambient sound quality along with crystal clear pictures."
  },
  {
    "name_small": "Dell Inspiron One 24 3464 60.45cm Windows 10 (Intel Core i3, 4GB, 1TB HDD)",
    "price": "₹48,634.00",
    "Key features": "",
    "Connectivity": {
      "Wireless": "802.11ac",
      "HDMI Interface": "1 Port",
      "Bluetooth": "v 4.0",
      "Ethernet": "Yes"
    },
    "Input Output Ports": {
      "Mic-In": "Yes",
      "USB Interface": "2 x USB 2.0/ 2 x USB 3.0",
      "LAN Interface": "RJ-45"
    },
    "Speaker Features": {
      "Speaker": "Stereo speakers professionally tuned with Waves MaxxAudio"
    },
    "Input Output Devices": {
      "Webcam": "Integrated Widescreen HD 720P Webcam with Single digital microphone"
    },
    "Operating System": {
      "Operating System": "Windows 10"
    },
    "Speed": {
      "speed": "2.30 GHz"
    },
    "memory": {
      "System Memory": "4 GB",
      "Memory card slot": "Yes"
    },
    "Colour Option": {
      "Colour option": "Black"
    },
    "Graphics Processor": {
      "Graphics processor": "Intel HD Graphics"
    },
    "Processor": {
      "Processor variant": "7100U",
      "Processor name": "Intel Core i3",
      "Processor brand": "Intel"
    },
    "Optical Drive": {
      "Optical drive": "Tray load DVD Drive (Reads and Writes to DVD/CD)"
    },
    "Performance": {
      "Hard disk speed": "5400 RPM"
    },
    "Storage": {
      "Hard disk type": "HDD"
    },
    "After Sales Service": {
      "Warranty": "1 Year Limited Hardware Warranty"
    },
    "category": "desktops",
    "url": "https://www.croma.com/dell-inspiron-one-24-3464-60-45cm-windows-10-intel-core-i3-4gb-1tb-hdd-/p/203634",
    "description": "Description for Dell Inspiron One 24 3464 60.45cm Windows 10 (Intel Core i3, 4GB, 1TB HDD) Dell Inspiron 3464 desktop   is the ideal choice for anyone who is an avid gadgets lover. It comes with technical engineering that is superior and efficient. It has been loaded with a bunch of modern innovations that is sure to make your computing experience an enjoyable one. It comes in a sleek and slender design along with a refined finish that is bound to impress you. Loaded with advanced visual and audio features, this desktop will make you swoon over its optimal performance. Experience fast computing like never before with this desktop that promises a glitch free performance. Amazing Display The Dell Inspiron 3464 desktop   features a 23.8 inches IPS screen, and is powered by a resolution of 1920 x 1080 pixels. Not only videos but even work gets interesting as you get to see those tables, charts or documents in Full HD. Equipped with Intel HD Graphics, it allows you to watch cutting-edge graphics when playing games. It comes in a wide view angle that makes your visual experience a pleasurable one. Processor And Memory The Dell Inspiron 3464 desktop   has been powered by seventh generation Intel Core i3 processor, it delivers seamless performance and transforms your overall working experience. It operates on Windows 10 home, to assist you in your day-to-day tasks. Besides, it also supports Wi-Fi and Bluetooth version 4.0, which allows speedy transmission and sharing of your data files. It also comes with micro USB 3.0 and USB 2.0 ports for an enhanced connectivity. This laptop offers an internal storage capacity of 1 TB HDD which is spacious enough to let you freely save all your entertainment and work data in a systematic manner. Download as much as movies and music you like, without worrying the least. In addition to it, a 4 GB RAM support makes your work process real smooth. Great Connectivity The Dell Inspiron 3464 desktop   comes with a micro HDMI port and a 3.5 mm audio jack, the laptop allows you to enjoy your favorite movies or videos in a personalized way. Besides, it comes with Waves Maxx Audio speakers that deliver stereo quality sound and takes your entertainment level to a new high."
  },
  {
    "name_small": "HP 20-c003in 50cm All-In-One Desktop (Black)",
    "price": "₹23,994.00",
    "Key features": "",
    "Connectivity": {
      "Wireless": "IEEE 802.11 b/g/n",
      "HDMI Interface": "Yes (1 x HDMI)",
      "Bluetooth": "v4.0",
      "Ethernet": "1000BASE-T Gigabit Ethernet"
    },
    "Card Support": {
      "Memory slot": "2 x DDR3L"
    },
    "Input Output Ports": {
      "Mic-In": "Yes",
      "USB Interface": "Yes (2 x USB 2.0/ 2 x USB 3.0 )",
      "LAN Interface": "Yes"
    },
    "Speaker Features": {
      "Speaker": "Yes"
    },
    "Input Output Devices": {
      "Webcam": "Yes (HP Web Cam)"
    },
    "Operating System": {
      "Chipset": "Yes/ Combined with the processor",
      "Operating System": "Microsoft Windows 10 Home (64-bit)"
    },
    "memory": {
      "System Memory": "4 GB",
      "Expandable upto": "Up to 8 GB on (64-bit)",
      "Memory card slot": "1 x M.2 slot"
    },
    "Dimension and Weigth": {
      "Weight (kg)": "4.79"
    },
    "Graphics Processor": {
      "Graphics processor": "Integrated Radeon R2 Series Graphics"
    },
    "Processor": {
      "Processor name": "AMD Carrizo-L E2-7110 (quad core processor)",
      "Processor brand": "AMD"
    },
    "Optical Drive": {
      "Optical drive": "Yes"
    },
    "Display Features": {
      "Monitor type": "TN WLED-backlit display (1600 x 900)",
      "Monitor size (inches)": "19.5"
    },
    "Storage": {
      "Hard disk type": "SATA"
    },
    "category": "desktops",
    "url": "https://www.croma.com/hp-20-c003in-50cm-all-in-one-desktop-black-/p/200109",
    "description": "Description for HP 20-c003in 50cm All-In-One Desktop (Black) The HP 20-c003in 50cm All-In-One Desktop (Black) is packed with remarkable functions, to take your computing experience to a whole new level. Its breathtaking look and arresting performance add charisma to this desktop. Crisp Display This HP desktop comes with a crystal clear display that gives you perfect and accurate colors on screen. Its display resolution of 1600 x 900, delivers true colors of images for enjoying high quality movies, viewing documents, playing games and more. Elegant appearance Appearance is one of the most important factors in buying a desktop. This desktop has an excellent appearance. Its classic black color comes as a feast to your eyes. It can also be easily adjusted to your needs, and comes with a beautiful and slim stand. Keep your peers in awe by using this stylish desktop. Powerful Processor The processor is usually denoted as the heart of a desktop. This desktop comes equipped with an AMD E2 processor, which delivers smooth functioning and faster running of all the applications installed on your desktop. It also has a memory up to 4 GB, and a 500 GB HDD, to store all your favorite photos and videos. Multitasking is also made very easy and smooth with this desktop. Additional features The Integrated speakers in this HP desktop give you great sound effects, to play your favorite songs, videos, and much more with ease. The desktop also contains a CD/DVD disk drive, that can transfer data up to 3,600 and 10,800 KB/s, respectively. Its HD Webcam lets you enjoy web conferences or online video chats with ease. The HP 20-c003in 50cm All-In-One Desktop (Black) is packed with fundamental features, and its overall performance is enhanced to deliver the finest user experience."
  }
]
