[
  {
    "name_small": "Sony PlayStation 4 1 TB Slim Gaming Console (Red Dead Redemption 2)",
    "price": "₹29,990.00",
    "Key features": "",
    "Media Formats Supported": {
      "Media type": "Console"
    },
    "Additional Features": {
      "Other features": "30 Percent Slimmer, 16 Percent Lighter Than Earlier PS4 Model, Store Your Games, Apps, Screenshots And Videos With 1 TB Storage, Experience Amazing HDR Quality Graphics"
    },
    "Platform Supported": {
      "Platform2": "PlayStation 4"
    },
    "General": {
      "Type of Product": "Gaming Console",
      "Brand": "Sony"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-playstation-4-1-tb-slim-gaming-console-red-dead-redemption-2-/p/215248",
    "description": "Description for Sony PlayStation 4 1 TB Slim Gaming Console (Red Dead Redemption 2) Now is the time to take your gaming experience to a whole new level and evolve the inner gamer in you with the all-new Sony 1 TB Ps4 Slim Gaming Console. This Is the new generation of Sony’s gaming console redefined. With the all-new compact generation of Playstation Sony has evolved modern gaming with next-generation graphics and a blazing fast gaming experience with extremely well detailed, vivid and colorful video output. This next generation of gaming console brings forth all the new games made specifically for the Ps4 which are called the exclusives. The Ps4 exclusives are made only for this console and are optimized to the brim for an extremely fluid and flawless experience. Be it graphics, responsiveness, compatibility, build quality Sony’s attention to detail is astonishing to the point. The Ps4 slim is 30% slimmer and 16% lighter than the earlier Ps4 model thus making it the more compact version of the already great Ps4. A Compact Playstation & Much More Now not only play the games and enjoy the experience but also share apps and screenshots in the gaming community or social media or both. With 1 TB storage, the Ps4 slim makes sure you never run out of space and easily store your games, apps and much more according to your needs. The Ps4 also boasts of a sturdy build quality and a compact design thus making sure it fits anywhere quite easily without any hassle and is extremely durable and lasts long. Red Dead Redemption II is Here The new Sony 1 TB PS4 Slim Gaming Console doesn’t only pack a punch when it comes to performance and audiovisual outputs but this time around the Ps4 slim comes with a game that is the sequel to arguably one of the greatest games ever made. A rockstar games’ original Red Dead Redemption II comes bundled with this version of the Ps4. This is a deal that is unmatched since Red Dead Redemption is the sequel to the gaming classic Red Dead Redemption which is one of the most successful and loved games of all time. This game runs fully optimized on the Ps4 and supports both full HD and 4K UHD for detailed, immersive and a fabulous gaming experience."
  },
  {
    "name_small": "Sony PS4 1TB Slim Console + (Free Game: FIFA19)",
    "price": "₹29,990.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Weight (kg)": "3.52"
    },
    "Operating System": {
      "Platform": "PlayStation 4"
    },
    "Additional Features": {
      "Other features": "Kick Off The Fifa 19 Football Season In Amazing Hdr Quality Graphics With The Jet Black Ps4 1 Tb Slim Console, 30 Percent Slimmer, 16 Percent Lighter Than Earlier Ps4 Model, Store Your Games, Apps, Screenshots And Videos With 1tb Storage"
    },
    "Look and Feel": {
      "Design": "FIFA 19"
    },
    "General": {
      "Brand": "Sony"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-ps4-1tb-slim-console-+-free-game-fifa19-/p/215189",
    "description": "Description for Sony PS4 1TB Slim Console + (Free Game: FIFA19) OverviewIt is time for gaming enthusiasts to get the Sony PS4 1TB Slim Console + (Free Game: FIFA 19) to have the best gaming experience. Unleash your FIFA skills with PS4 and play different leagues to improve your score. Inside the box you will find 1 gaming PS4 console, a manual that will explain the features, connecting cables, FIFA 19 Game Disc and a dualshock 4 controller.PS4 Console & 1 TB of StorageThis 1TB console has powerful graphics and speed, connected gaming, deeply integrated social capabilities, smart intelligent personalization and more. Not only that the large 1TB hard drive gives you ample space to store blockbuster games, plenty of apps, recorded game footage and more. Plunge into exclusive games which will take you on incredible journeys and create best experiences. Experience endless entertainment and find what you're looking for and get it at the touch of a button via various PlayStation entertainment options.DualShock 4 ControllerThe best-in-class analog sticks and trigger buttons provide unparalleled accuracy with every move while innovative technologies offer exciting ways to experience your games and share your greatest moments. Simply, get comfortable on the couch and enjoy this controller to play your favourite game. Additionally, the controller has a smooth finish and one can hold it very easily.Game FeaturesThe Sony PS4 1TB Slim Console + (Free Game: FIFA 19) lets you enjoy your favourite FIFA game. FIFA 19 provides a champion-calibre experience on and off the pitch. It brings the prestigious UEFA Champions League, offering gameplay innovation that allows you to control the football pitch in every moment and providing new ways to play. Experience best grand finale to the story of Alex Hunter in The Journey: Champions, a new mode in the ever-popular FIFA Ultimate Team, additional leagues in Career Mode, and more. Play the one and only one club football across a variety of modes in FIFA 19 with official match presentation, breadth in tournament experiences, including UEFA Champions League, Europa League and Super Cup. The Sony PS4 1TB Slim Console + (Free Game: FIFA 19) is a must buy for many gaming enthusiasts and can add the FIFA 19 to their collection."
  },
  {
    "name_small": "Sony PSVR Aim Controller Bundle with Bravo Team",
    "price": "₹7,299.00",
    "Key features": "",
    "Operating System": {
      "Platform": "Sony PlayStation 4"
    },
    "Additional Features": {
      "Other features": "System Requirements : PS4 Console , PS VR And PS4 Camera"
    },
    "General": {
      "Pegi rating": "18",
      "Model Number": "PSVR Aim Controller Bundle with Bravo Team",
      "Brand": "Sony"
    },
    "Company Contact Information": {
      "Generic Name": "Gaming Console"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-psvr-aim-controller-bundle-with-bravo-team/p/209477",
    "description": "Description for Sony PSVR Aim Controller Bundle with Bravo Team Enjoy a one of a kind gaming experience and feel totally immersed in the action with this Sony PSVR Aim Controller Bundle with Bravo Team Game. The controller allows you to take part in amazing combat battle which requires you to take decisions in split seconds to ensure you carry on in the game. The controller bundle allows you to experience every explosion in intense guerrilla firefights and fight together with your with your teammate. The controller allows you to physically take aim and dispatch enemies to give you a real-life experience. The Brave Team game gives you just the right means of enjoying every aspect of the controller bundle. Immersive Gaming Experience The Sony PSVR Aim Controller Bundle with Bravo Team Game is sure to give you a one of a kind experience thanks to all the amazing features it brings along with it. The controller puts you in between a full-on intense combat and split-second tactical decision-making situation where you need to counter challenges that can halt you on your tracks. You can Take Aim and dispatch enemy insurgents with precision accuracy through the Aim controller and enjoy the fluid gameplay and an array of weapons at your disposal. Brilliant Game To Go Along This set also features the amazing Bravo Team game that allows you to enjoy maximum functionality from the controller. It allows you to step into an urban war zone and experience every explosion in intense guerrilla firefights. The game allows you to take up a variety of shotguns, pistols and automatic weapons and you also have to duck into cover and make every shot count."
  },
  {
    "name_small": "Sony PlayStation 4 Slim 500 GB with Gran Turismo Sport, Uncharted 4 and Horizon Zero Dawn",
    "price": "₹22,990.00",
    "Key features": "",
    "Audio / Video Output": {
      "AV output": "HDMI out port (HDR output supported)"
    },
    "Connectivity": {
      "Wireless": "IEEE 802.11 a/b/g/n/ac",
      "Bluetooth": "Bluetooth v4.0",
      "Ethernet": "1 x 10BASE-T, 100BASE-TX, 1000BASE-T"
    },
    "Main Product Features": {
      "Power Supply": "AC 100 - 240 V, 50/60 Hz"
    },
    "Additional Features": {
      "Other features": "Main processor : Single-chip custom processor, CPU : x86-64 AMD “Jaguar”, 8 cores GPU : 1.84 TFLOPS, AMD Radeon based graphics engine, Storage size : 500 GB, Power consumption : Max. 165W, Operating Temperature : 5 degree C – 35 degree C"
    },
    "memory": {
      "Memory": "GDDR5 8 GB"
    },
    "Dimension and Weigth": {
      "Dimensions": "265 × 39 × 288 mm (External)",
      "Weight (kg)": "2.1"
    },
    "General": {
      "Brand": "Sony",
      "Model Number": "PlayStation 4 Slim 500 GB"
    },
    "Input / Output Connectors": {
      "Input / Output": "Super-Speed USB (USB 3.1 Gen1) port × 2  AUX port × 1"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-playstation-4-slim-500-gb-with-gran-turismo-sport-uncharted-4-and-horizon-zero-dawn/p/209073",
    "description": "Description for Sony PlayStation 4 Slim 500 GB with Gran Turismo Sport, Uncharted 4 and Horizon Zero Dawn Enjoy a truly advanced gaming experience thanks to the amazing Sony PlayStation 4 which immerses your senses into a game of virtual reality. The Ultra-fast customized processors and 500 GB unified system memory allow you to experience nonstop gaming without any glitches and lagging and gives you ample space to store your apps, games, and videos. The PlayStation provides breathtaking HDR visuals and vibrant colors to give you an almost real-life gameplay. The Sony PlayStation 4 comes with three free games - Gran Turismo Sport, Uncharted 4 and Horizon Zero Dawn - and allows you almost real-life gameplay and is sure to capture your senses and take you into a gaming zone like never before. Efficient Performance Your gaming experience is sure to be on a whole new level as the Sony PlayStation 4 brings with it a performance like never before. The resolution ranges from 1080p to 1440p on an HD TV while enhanced upscaling techniques can increase game resolutions to approach 4K. The improved focus provided by the amazing graphics provide detailed viewing and make the images appear smoother and more realistic. The HDR visuals you experience bring out vibrant colors to give you a breathtaking experience. The 500 GB Hard disk drive further enhance the performance of the product and allows you to store your apps, games, and videos making it the perfect gaming partner for you. Premium Quality Not only does the Sony PlayStation 4 give you efficient gameplay but also has the ability to give your gaming experiences a new dimension. The PlayStation comes with three free games - Gran Turismo Sport, Uncharted 4 and Horizon Zero Dawn - to get you started on your gaming journey. The PlayStation also comes with a slimmer body and a lighter weight to ensure your gaming experience is a convenient one."
  },
  {
    "name_small": "Sony PlayStation 4 Pro 1 TB (Black)",
    "price": "₹37,990.00",
    "Key features": "",
    "Connectivity": {
      "HDMI Interface": "supports 4K/HDR",
      "Bluetooth": "Bluetooth 4.0 (LE)",
      "Ethernet": "Ethernet (10BASE-T, 100BASE-TX, 1000BASE-T)×1",
      "USB": "Super-Speed USB (USB 3.1 Gen.1) port × 3",
      "Wireless Connectivity": "IEEE 802.11 a/b/g/n/ac"
    },
    "Main Product Features": {
      "Power Supply": "AC 100-240V, 50/60Hz"
    },
    "Additional Features": {
      "Other features": "CPU: x86-64 AMD “Jaguar”, 8 cores, GPU: 4.20 TFLOPS, AMD Radeon™ based graphics engine"
    },
    "memory": {
      "Internal memory": "1 TB",
      "Memory": "GDDR5 8GB"
    },
    "Dimension and Weigth": {
      "Dimensions": "295 × 55 × 327 mm",
      "Weight": "3.3 kg"
    },
    "General": {
      "Brand": "Sony",
      "Type": "Gaming Console",
      "Model Number": "PlayStation 4 Pro"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-playstation-4-pro-1-tb-black-/p/208749",
    "description": "Description for Sony PlayStation 4 Pro 1 TB (Black) Bring home the amazing and power packed Sony PlayStation 4 Pro Console which is sure to bring out the gamer within you. The gaming console with its advanced features is sure to immerse your senses into a world of virtual reality. The Ultra-fast processors allow you to experience nonstop gaming without any glitches and lagging. The 1 TB capacity allows you to store all your games, videos and images to ensure it is your one stop entertainment companion. The amazing graphics, speed and visuals are backed by a super slim design to ensure you are equipped to take on gaming challenges and enjoy your virtual reality experience. Efficient Performance Your gaming experience is sure to be on a whole new level as the Sony PlayStation 4 Pro Console brings with it a performance like never before. The Ultra-fast processor ensures lag free gaming experience and is sure to get you immersed in a world of virtual reality. The breath taking display lets you experience vibrant colours to give you a truly enchanting and immersive experience. The 1 TB Hard disk drive further enhance the performance of the product and allows you to store your apps, games and videos making it the perfect gaming partner for you. Premium Design Not only does the Sony PlayStation 4 Pro Console  give you efficient gameplay but also has the ability to give your gaming experiences a new dimension. The PlayStation also comes with a slimmer and sleek design body and a lightweight design that is lighter than previous models to ensure your gaming experience is a convenient one."
  },
  {
    "name_small": "Sony PlayStation 4 Slim 500 GB Limited Ediition (White)",
    "price": "₹29,990.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Dimensions": "265 × 39 × 288 mm",
      "Weight (kg)": "2.1"
    },
    "Audio / Video Output": {
      "AV output": "HDMI out port (HDR output supported)"
    },
    "Connectivity": {
      "Wireless": "IEEE 802.11 a/b/g/n/ac",
      "Bluetooth": "Bluetooth v4.0",
      "Ethernet": "1 x 10BASE-T, 100BASE-TX, 1000BASE-T"
    },
    "memory": {
      "Memory": "GDDR5 8GB"
    },
    "External Memory": {
      "Memory storage": "500 GB"
    },
    "Additional Features": {
      "Other features": "Single-Chip Custom Processor, CPU : x86-64 AMD “Jaguar”, 8 cores, GPU : 1.84 TFLOPS, AMD Radeon Based Graphics Engine, BD/ DVD Drive (Read Only) : BD × 6 CAV, DVD × 8 CAV, Operating Temperature : 5 Degree C – 35 Degree C"
    },
    "Input / Output Connectors": {
      "Input / Output": "Super-Speed USB (USB 3.1 Gen1) Port × 2  AUX Port × 1"
    },
    "Look and Feel": {
      "Colour option": "White"
    },
    "General": {
      "Model Number": "PlayStation 4 Slim",
      "Brand": "Sony"
    },
    "Power": {
      "Power consumption (watts)": "165",
      "Power": "AC 100 - 240 V, 50/60 Hz"
    },
    "Company Contact Information": {
      "Generic Name": "Gaming Console"
    },
    "category": "consoles gaming",
    "url": "https://www.croma.com/sony-playstation-4-slim-500-gb-limited-ediition-white-/p/204795",
    "description": "Description for Sony PlayStation 4 Slim 500 GB Limited Ediition (White) Enjoy a scintillating gaming experience with the help of the amazing Sony PlayStation 4 Limited Edition and immerse yourself into a world of virtual reality. The Ultra-fast customized processors and 500 GB unified system memory allow you to experience nonstop gaming without any glitches and lagging and gives you ample space to store your apps, games, and videos. The PlayStation provides breathtaking HDR visuals and vibrant colors to give you an almost real-life gameplay. The gaming console also comes with amazing connectivity features to ensure you can always have unlimited things to explore making it the perfect gaming option for you. Efficient Performance Your gaming experience is sure to be on a whole new level as the Sony PlayStation 4 Limited Edition brings with it a performance like never before. The resolution ranges from 1080p to 1440p on an HD TV while enhanced upscaling techniques can increase game resolutions to approach 4K. The improved focus provided by the amazing graphics provide detailed viewing and make the images appear smoother and more realistic. The HDR visuals you experience bring out vibrant colors to give you a breathtaking experience. The 500 GB Hard disk drive further enhance the performance of the product and allows you to store your apps, games, and videos making it the perfect gaming partner for you. Premium Qualities Not only does the Sony PlayStation 4 Limited Edition give you efficient gameplay but also has the ability to give your gaming experiences a new dimension. The wide range of connectivity features like the HDMI out port,2 x USB 3.1 Gen1, 1 Aux port along with a super stable and fast Bluetooth and Wi-Fi connectivity allows you to expand the horizons of your gaming and entertainment possibilities. The PlayStation also comes with a slimmer body and a lighter weight to ensure your gaming experience is a convenient one."
  }
]
