[
  {
    "name_small": "Cosmic Byte H1 Gaming Headset with Mic (Red)",
    "price": "₹1,099.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Driver Unit (mm)": "40"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2.1"
    },
    "Input Output Ports": {
      "Audio Jack": "3.5",
      "Mic jack": "3.5"
    },
    "Audio Features": {
      "Impedance (Ohms)": "32"
    },
    "Look and Feel": {
      "Colour": "Red"
    },
    "General": {
      "Type of Product": "Gaming Headset",
      "Model Number": "TCBP03240"
    },
    "Compatibility": {
      "compatibledevices": "PS4, Mobiles, Xbox One, Tablets, Laptops, PC"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-h1-gaming-headset-with-mic-red-/p/213062",
    "description": "Description for Cosmic Byte H1 Gaming Headset with Mic (Red) Overview Get an all-immersive sound with crystal-clear mics with a great gaming headset to really get into that game and have a fantastic, enjoyable time! Cosmic Byte Gaming Headset H1 brings to you precise, high-quality audio with the perfect technology required for high performance and maximum satisfaction. Furthermore, Cosmic Byte H1 comes with a long life. It can boast of a class of its own and is great for communicating with other players while on the go! Main Features Cosmic Byte Gaming Headset H1 comes with a Mic for PC, Laptops, Mobile, PS4, Xbox that makes it easier to communicate with other players while you are on the go! The fiery, stunning red colour gives it a classy look that ensures that your style quotient is up at all times. It has a driver size of 40mm, an impedance of 32 Ohms and comes with a cable that is 2.1m long. Equipped with additional features like MicSwitch and Volume Controller, this headset is your idea pick for gaming for an all-immersive and an entertaining experience. Moreover, it comes with a dual 3.5mm jack for audio and mic. It is compatible with PS4, Mobiles, Xbox One, Tablets, Laptops, PC."
  },
  {
    "name_small": "Cosmic Byte H1 Gaming Headset with Mic (Blue)",
    "price": "₹1,099.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Driver Unit (mm)": "40"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2.1"
    },
    "Input Output Ports": {
      "Audio Jack": "3.5mm",
      "Mic jack": "3.5mm"
    },
    "Audio Features": {
      "Impedance (Ohms)": "32"
    },
    "Look and Feel": {
      "Colour": "Blue"
    },
    "General": {
      "Type of Product": "Gaming Headset",
      "Model Number": "TCBP03239"
    },
    "Compatibility": {
      "compatibledevices": "PS4, Mobiles, Xbox One, Tablets, Laptops, PC"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-h1-gaming-headset-with-mic-blue-/p/212934",
    "description": "Description for Cosmic Byte H1 Gaming Headset with Mic (Blue) Overview For an immersive sound with crystal-clear mics, all you need is a good gaming headset to really get into that game and have a good, enjoyable time! Cosmic Byte Gaming Headset H1 brings to you great audio with the technology required for high performance and maximum satisfaction. Besides, Cosmic Byte H1 comes with a long life. It has a class of its own and is great to communicate with other players while on the go! Main Features Cosmic Byte Gaming Headset H1 comes with a Mic that it is compatible with PC, Laptops, Mobile, PS4, Xbox One which in turn makes it easier to communicate with other players while you are on the go and makes the experience all-engaging! Besides, it has a stunning, classy look that ensures that your style quotient is up at all times. It has a driver size of 40mm, an impedance of 32 Ohms and comes with a cable that is 2.1m long. Equipped with added features like MicSwitch and Volume Controller, this headset is your ideal pick for gaming for an all-immersive and an entertaining experience. Besides, it comes with a dual 3.5mm jack for audio and mic."
  },
  {
    "name_small": "Cosmic Byte G4000 Edition Headset with Mic (Blue)",
    "price": "₹1,199.00",
    "Key features": "",
    "Look and Feel": {
      "Colour": "Blue"
    },
    "General": {
      "Type of Product": "Gaming Headset",
      "Model Number": "TCBP03205"
    },
    "Compatibility": {
      "compatibledevices": "PS4,  PS3,  Xbox 360,PC, Computer, Laptop"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-g4000-edition-headset-with-mic-blue-/p/212935",
    "description": "Description for Cosmic Byte G4000 Edition Headset with Mic (Blue) Overview For an immersive sound with crystal-clear mics, all you need is a good gaming headset to really get into that game and have a great, enjoyable time! Cosmic Byte Gaming Headset G4000 brings to you precise audio with technology required for high performance and maximum satisfaction. Besides, Cosmic Byte G4000 comes with a long life. It has a class of its own and is great to communicate with other players while on the go! Main Features Cosmic Byte Gaming Headset G4000 is a primary kind of gaming headset which is perfect for playing games, listening to music, etc. It comes with a soft cushion head-pad and ear-pad, as well as adjustable length hinges that guarantee hours of gaming comfort. Additionally, these gaming headsets are equipped with flexible microphone that offers exact positioning and a mic with great sensitivity at picking up sounds. If you want to communicate effectively with your partner, this is your ideal pick as it transmits words clearly. Furthermore, it comes with a little smart in-line remote control for sound and mic. There are also LED lights designed on the ear cups that make it look more fashionable and stunning and an irresistible buy.  Added Features Cosmic Byte Gaming Headset G4000 is your choice for a professional gaming headset with Mic USB and 3.5mm audio connector that is specially designed for PC computer or laptop gaming. In addition, you can also use it for PS4 PS3 Xbox 360 if you have an adaptor. With great sound quality and a spatial sound effect, these headsets sure do not miss to impress you."
  },
  {
    "name_small": "Cosmic Byte G3300 Saturn Rings Gaming Headset (Multicolour)",
    "price": "₹1,999.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Driver Unit (mm)": "50"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2.1"
    },
    "Input Output Ports": {
      "Audio Jack": "3.5mm",
      "Mic jack": "3.5mm"
    },
    "Audio Features": {
      "Impedance (Ohms)": "32"
    },
    "Look and Feel": {
      "Colour": "Multicolour"
    },
    "General": {
      "Type of Product": "Gaming Headset",
      "Model Number": "TCBP03241"
    },
    "Compatibility": {
      "compatibledevices": "PS4, Mobiles, Xbox One, PC"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-g3300-saturn-rings-gaming-headset-multicolour-/p/212933",
    "description": "Description for Cosmic Byte G3300 Saturn Rings Gaming Headset (Multicolour) Overview Get an all-immersive sound with crystal-clear mics with a good gaming headset to really get into that game and have a great, enjoyable time! Cosmic Byte Gaming Headset RGB G3300 brings to you precise audio with the technology required for high performance and maximum satisfaction. Moreover, Cosmic Byte G3300 comes with a long life. Having a class of its own, it is great for communicating with other players while on the go! Main Features Cosmic Byte Gaming Headset RGB G3300 comes with a Mic that makes it easier to communicate with other players while you are on the go! RGB LED (Blue) gives it a stunning, classy look that ensures that your style quotient is up at all times. It has a driver size of 50mm, the impedance of 32 Ohms and comes with a cable that is 2.1m long. Equipped with features like MicSwitch and Volume Controller, this headset is your ideal pick for gaming for an all-immersive and an entertaining experience. Besides, it comes with a dual 3.5mm jack for audio and mic. It works brilliantly with PC without the splitter. For PS4, Mobiles, Xbox though, you need 1 male, 2 female splitters."
  },
  {
    "name_small": "",
    "price": "",
    "Key features": "",
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-kotion-gs420-gaming-headset-with-mic-blue-/p/212932",
    "description": ""
  },
  {
    "name_small": "HP GK1000 Gaming Combo (Black)",
    "price": "₹1,399.00",
    "Key features": "",
    "Suggested Usage": {
      "Suitable for": "Laptops, Gaming, Music, Audio Player, Computers, PlayStation, gaming consoles"
    },
    "Additional Features": {
      "Other features": "Included Components: Gaming Wired Keyboard and Gaming Wired Mouse"
    },
    "Dimension and Weigth": {
      "Dimensions": "57 x 22 x 6 cm (Package Dimensions)",
      "Weight (kg)": "1.17"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type of Product": "Mouse and Keyboard Combo",
      "Model Number": "3DR57PA"
    },
    "After Sales Service": {
      "Manufacturer Warranty": "1 Year"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/hp-gk1000-gaming-combo-black-/p/211518",
    "description": "Description for HP GK1000 Gaming Combo (Black) OverviewIf you're a gamer, you take your choice of keyboard and mouse seriously. When your keyboard doubles as your game controller, it becomes more than just a tool for typing, it becomes an extension of yourself, your interface with the digital world. Similarly, the mouse isn't just the one that fits comfortably in your hand. The gaming mice need to have lower latency than a standard office mouse, needs to come with better driver software that enhances the mouse, needs to support high DPI settings, and at the same time remain extremely accurate even when you swipe it as fast as you can.  If you care about PC gaming, it pays to buy a keyboard and mouse that's just right for you. Since gaming keyboards and mouse accessories can be pretty expensive especially when you buy them separately, it is a good decision to go for a combo of keyboard and mouse which complement each other and raises your game to the next higher level. The HP GK1000 Gaming Combo is a user-friendly set of keyboard and mouse for game playing. HP GK1000 Gaming Combo Keyboard The HP GK1000 Gaming Combo Keyboard has all the makings of the full-fledged gaming keyboard. It is a mechanical keyboard designed to provide superior audio and tactile performance. The full-size, membrane keyboard provides increased productivity and accuracy. The keys are tactile and responsive during games. The top of the keys is slightly curved for a comfortable typing experience. There is ample space between them which minimizes the chances of accidentally pressing the neighboring keys. The palm rest below the keys looks spacious and feels comfortable while typing. It has all the required gaming function keys and multimedia keys cooperated with FN key for overall comfort and control. The HP GK1000 Gaming Combo Keyboard combines is fitted with durable HP mechanical switches. HP mechanical switches deliver quick, precise mechanical performance with incredible comfort and durability with 10M click-life. The HP GK1000 Gaming Combo keyboard provides rock-solid reliability as it is rated over 10 million keystrokes, and helps ensure lasting precision. The keyboard works with all Windows PCs via USB and doesn’t require a battery to power up. Users do not have to install software either. The HP GK1000 Gaming Combo Keyboard is a perfect blend of speed, precision, and quiet performance. HP GK1000 Gaming Combo Mouse The other component in the HP GK1000 Combo is the backlit optical gaming mouse. It is big in size and provides ample space for the palm rest. When connected to the PC via the USB cable, the top panel lights up. Users can change the colour of the light by rolling the scroll wheel. The HP GK1000 Gaming Combo Mouse allows resolution between 1000 and 1600 DPI optical tracking wherein the two DPI gears can be switched randomly through the DPI button. The HP GK1000 Gaming Combo Mouse has 4 buttons for easy navigation and a colourful backlit display. The DPI button can adjust the movement and speed of the mouse. The high-end optical engine adds precision targeting and consistent response to your gameplay. Designed to be eSports ready with an ergonomic right-hand design and rubber grips for added control and comfort, the textured rubber grips on the sides help to keep your fingers from slipping, a common problem for usual sweaty-handed gamers. You can customize your mouse with illuminated colours using the scroll wheel. With endurance rating up to 5 million-clicks, the HP GK1000 Gaming Combo Mouse assures you of a long gameplay life!"
  },
  {
    "name_small": "SteelSeries Flux Gaming Headset - Luxury Edition for PC/Mobile (Black)",
    "price": "₹994.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Dimensions": "17.6 x 18.3 x 3.5 cm",
      "Weight (g)": "168"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2"
    },
    "Input Output Ports": {
      "Audio Jack": "3.5mm"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type of Product": "Headset",
      "Model Number": "61283"
    },
    "Compatibility": {
      "compatibledevices": "PC, Mac, Mobile"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/steelseries-flux-gaming-headset-luxury-edition-for-pc-mobile-black-/p/211394",
    "description": "Description for SteelSeries Flux Gaming Headset - Luxury Edition for PC/Mobile (Black) Overview A PC gaming headset is important when you want to play competitively and also when you want to indulge in a little late-night gaming without waking the whole neighborhood. If you’re looking for great sound while playing on your PC then you need gaming headsets to hear all those immersive background noises, sound effects, and dialogs as clearly as possible. The SteelSeries Flux Gaming Headset Luxury Edition is a slim foldable gaming headset ideal for on-the-go and has on cable microphone which will fulfill all your gaming chat needs too. Stylish yet comfortable design, as well as great audio reproduction during gameplay and movies/music, makes it a must-have headset. Manufactured by the Danish peripheral manufacturer, SteelSeries, the SteelSeries Flux is a premium luxury gaming headset. Comfortable Earpieces with SNDBlock The word “Flux” is derived from the Latin word “Fluxus”, which means “to flow”. The SteelSeries Flux Gaming Headset Luxury Edition is a durable, comfortable headset with a chat mic built into its heavy gauge rubber cables. This headset in a uniform black design with silver side plates and an orange cable has pleather ear cushions and a dedicated carrying case storing the headset. This luxury gaming headset comes with on-ear earcups, an orange cable and a set of exclusive silver earcup covers in a sleek frame designed to be hung around your neck. The headphone jacks are placed under both the earcups, both of which may be used to connect to the audio jack. The two audio ports are more than just for convenience. You can plug another pair of headphones into one of the audio ports and share the audio, which is great for sharing music with your friends! For a great audio experience, the SteelSeries Flux Gaming Headset Luxury Edition features SNDBlock acoustic material inside the comfortable cloth cushions. SNDBlock provides superb sound isolation while still remaining comfortable and breathable keeping outside noise out and inside noise in. Compact and Convenient Design For better portability/storage, the SteelSeries Flux Gaming Headset Luxury Edition incorporates a collapsible, folding design that enables it to be folded neatly into the included pouch. The multi-use headset was designed to be travel-friendly. The earcups can be swiveled 90° to face down for easy storage which also helps the headphones hang around your neck more comfortably. The headband size can be adjusted by pulling down on the earcups. Durable and meant for easy travel, the frame is springy and malleable. Built with several points of articulation, it's made to stretch and bend, so it becomes easy to toss it into a bag without fear of damage. The cords are made for travel too. The thick rubber they're encased in doesn't tangle easily and can be easily disconnected completely from the headset and can be stored separately, for added safety from damage.  Accurate Sound Quality Featuring solid stereo sound performance, this headset with in-line pause/play controls and a hidden microphone gives you a cool looking headset that looks as good as it sounds. You can always count on SteelSeries Flux Gaming Headset Luxury Edition for its pristine audio. The earpiece comes with a frequency response of 18 to 28000Hz and an impedance of 29 Ohm, while the microphone has a frequency response of 50 to 16000Hz and sensitivity of -38dB. Connectivity is provided in two ways, either with a cable that has the microphone and audio split into separate 3.5mm jacks, or the cable that has both integrated onto the one jack. The first cable is typically used with PCs while the second one is used with smartphones or portable music players. Compatible with PC, Mac, and Mobile devices, the SteelSeries Flux Gaming Headset features new, on-ear pleather mesh cloth cushions that pump out impressive sound levels via its 40mm driver units. Powered by these 40mm drivers, the SteelSeries Flux Gaming Headset has the acoustic intensity you have come to expect from SteelSeries audio. Whether gaming, listening to music or watching movies, you are guaranteed an incredible audio experience. So, if you're looking for a comfortable, sturdy and deep-sounding headset, the SteelSeries Flux Gaming Headset Luxury Edition should be your choice! Accessories Included This Luxury Edition gaming headset is decked out with accessories. Included in the box are two connection wires; one for the PC, which has both the 3.5mm microphone jack and the 3.5mm audio-in jack, and another 2 in 1 cable for your MP3 player/Phone. The package also includes an extra set of glossy black side plates and black SNDBlock cloth ear cushions for the all-black look. Finally, a carrying case is included to carry it all with a zipper to keep things from falling out."
  },
  {
    "name_small": "Acer Predator Galea 500 Gaming Headphones (Black)",
    "price": "₹7,994.00",
    "Key features": "",
    "Connectivity": {
      "Interface": "USB (Host)"
    },
    "Main Product Features": {
      "Microphone": "Technology : Uni-Directional"
    },
    "Suggested Usage": {
      "Wearing style": "Over The Ear"
    },
    "Additional Features": {
      "Other features": "Connector Plating : Gold Plated,  True Harmony 3D Sound, Retractable Uni-directional Microphone, Soft Cushion Ear Pods"
    },
    "Dimension and Weigth": {
      "Driver Unit (mm)": "39.87"
    },
    "Frequency Response": {
      "Frequency response": "100 Hz to 10 kHz (Microphone)"
    },
    "Audio Features": {
      "Impedance": "2.2 Kilo Ohm, 2.2 Kilo Ohm (Microphone)"
    },
    "Sensitivity": {
      "Sensitivity (db)": "-40 (Microphone), 112 (Earpiece)"
    },
    "Look and Feel": {
      "Colour option": "Black",
      "Design": "Textured Surface With Detail Polishing, Boom (Microphone)"
    },
    "General": {
      "Type": "Binaural (Earpiece)",
      "Type of Product": "Gaming Headphones",
      "Model Number": "Predator Galea 500"
    },
    "Body Material": {
      "Form factor": "Circumaural"
    },
    "After Sales Service": {
      "Warranty": "Limited Warranty Agreement Applies"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/acer-predator-galea-500-gaming-headphones-black-/p/209276",
    "description": "Description for Acer Predator Galea 500 Gaming Headphones (Black) Hearing music never felt easier as the Acer Galea500 Predator Headset with its lightweight and comfortable design gives you an audio experience like never before. The headset provides you with a cinema-like clarity sound experience as the drivers help you to immerse yourself in a world of virtual reality. The headset comes with a flexible microphone that can be adjusted easily and the noise canceling function blocks off any unnecessary sound. The headset comes with cups that are specially designed for advanced comfort during your gaming experience and keeps irritating factors away so that you can use the headset for long periods of time. The headset combines the quality of audio and comfort together to give you an audio experience like never before. Comfortable Design The earphone is built with extreme precision and has an ergonomically comfortable design. It comes with specially designed optimized ear pads to provide you comfort so that you can use the headset for long periods of time with any irritation. The lightweight cup design isolates your hearing senses from the outside noise and allows you to immerse yourself into the gaming world. The gold plated connector and Textured Surface with Detail Polishing give it a very distinct look. The microphone is very easy to adjust to give you an enhanced video and voice calling experience. An Enhanced Audio Experience The Acer Galea500 Predator Headset ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion-free audio. The bio-cellulose membrane driver and rubber surround ensure crystal clear cinema-like sound while the TrueHarmony 3D Soundscape Technology gives you a one of a kind experience."
  },
  {
    "name_small": "Gamdias Hebe E1 RGB Gaming Headset (Black)",
    "price": "₹1,999.00",
    "Key features": "",
    "Main Product Features": {
      "Microphone": "Pick up Pattern : Omnidirectional",
      "Driver Unit": "Magnet :NdFeB"
    },
    "Input and Output connectors": {
      "Plug type": "USB And 3.5 mm Mic/ Audio Plug"
    },
    "Additional Features": {
      "Other features": "Ergonomic Comfort, Smart Remote Controller"
    },
    "Dimension and Weigth": {
      "Dimensions": "188 x 104 x 230 mm",
      "Driver Unit (mm)": "40"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2"
    },
    "Audio Features": {
      "Impedance": "32 Ohm + / - 15%"
    },
    "Sensitivity": {
      "Sensitivity": "-58 db +- 3 db (Microphone)",
      "Sensitivity (db)": "116 +- 3"
    },
    "Look and Feel": {
      "Colour option": "Black",
      "Design": "Oversized Earcup"
    },
    "General": {
      "Type of Product": "Hebe E1"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/gamdias-hebe-e1-rgb-gaming-headset-black-/p/209241",
    "description": "Description for Gamdias Hebe E1 RGB Gaming Headset (Black) Enjoy an audio experience like never before as the Gamdias Hebe E1 RGB Headset gives you a truly enhanced audio experience and improves your gaming needs like never before. The headset with its cup design is extremely comfortable to wear and provides premium virtual surround sound so that you can immerse yourself in a world of virtual reality. The RGB Visual Illumination gives out attractive lighting when you use it while the 40 mm HD drivers give you crystal clear gaming experience. The headset comes with a flexible microphone that can be adjusted easily and the noise canceling function blocks off any unnecessary sound. The headset combines the quality of audio and comfort together to give you an audio experience like never before. Comfortable Design The Gamdias Hebe E1 RGB Headset is built with extreme precision and has an ergonomically comfortable design. It comes with oversized ear cups to provide you comfort so that you can use the headset for long periods of time with any irritation. The RGB lighting gives you multi-color lighting effects provide stunning illumination lighting and vibration effects. The cup design isolates your hearing senses from the outside noise and allows you to immerse yourself in the gaming world. The retractable microphone is very easy to adjust to give you an enhanced video and voice calling experience. The smart remote control allows you to operate the headset very conveniently. An Enhanced Audio Experience The Gamdias Hebe E1 RGB Headset ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion-free audio. The 40 mm HD drivers and a sensitivity level of 116±3dB gives you a dynamic and enthralling music experience. Further, Omnidirectional Flexible Microphone gives you studio like sound and cancels out any background noise so that you can speak clearly and enjoy the entire headset experience."
  },
  {
    "name_small": "Logitech G233 Prodigy Wired Gaming Headphones (Black)",
    "price": "₹6,995.00",
    "Key features": "",
    "Main Product Features": {
      "Microphone": "Back Electret Condenser (Type)"
    },
    "Additional Features": {
      "Other features": "Package Contents : G233 Wired Gaming Headset, Detachable Microphone Boom With Micro Pop Filter, Mobile Cable With Inline Controls And Mic, Console/pc Cable With Inline Controls, Pc Splitter For Separate Mic And Headphone Jacks, User Documentation, Microphone Pickup Pattern : Cardioid (Unidirectional), Microphone Size : 4 Mm, Extremely Lightweight For Maximum Comfort;  Pro-g Technology - Delivers Booming Bass And Precise Highs: Sleek;  Streetable Headset: Detachable Boom Mic And Two Audio Cables Included;  Micro-pop Filter To Reduce Environmental Noises And Deliver Clear Communications, Officially Discord Certified, Incredible Audio And Voice Clarity, Sports-mesh Ear Pads, Patent-pending Design, Gaming Audio"
    },
    "Dimension and Weigth": {
      "Weight (g)": "259",
      "Dimensions": "172 x 81.7 x 182 mm",
      "Driver Unit (mm)": "40"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2 (PC), 1.5 (Mobile)"
    },
    "Frequency Response": {
      "Frequency response": "20 Hz - 20 KHz"
    },
    "Input Output Ports": {
      "Audio Jack": "3.5 mm"
    },
    "Frequency Range": {
      "Microphone Frequency Response (Hz)": "10 - 10000"
    },
    "Audio Features": {
      "Impedance": "32 Ohms"
    },
    "Sensitivity": {
      "Sensitivity": "107 dB at 1 KHz SPL 30 mW / 1 cm"
    },
    "Look and Feel": {
      "Colour option": "Black"
    },
    "General": {
      "Type of Product": "Wired Gaming Headphones",
      "Model Number": "G233 Prodigy"
    },
    "OS Compatibility": {
      "Compatible operating systems": "Windows 10, Windows 8.1, Windows 8, Windows 7"
    },
    "Compatibility": {
      "compatibledevices": "PS4, Xbox One"
    },
    "After Sales Service": {
      "Warranty": "2-Year Limited Hardware Warranty"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/logitech-g233-prodigy-wired-gaming-headphones-black-/p/208987",
    "description": "Description for Logitech G233 Prodigy Wired Gaming Headphones (Black) Your gaming experience is sure to be taken to a whole new level with the power-packed Logitech Prodigy G233 Gaming Headset. The headset provides you with a serious mind-boggling sound experience as the 40mm drivers help you to immerse yourself in a world of virtual reality. The headset comes with a noise-canceling boom microphone with a micro-pop filter that can block off any unnecessary sound. The sports-mesh ear pads are specially designed for advanced comfort during your gaming experience and keep sweat and any other irritating factors away so that you can use the headset for long periods of time. The headset combines the quality of audio and comfort together to give you an audio experience like never before. An Enhanced Audio Experience The Logitech Prodigy G233 Gaming Headset ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion-free audio. The 40mm drivers and a sensitivity level of 107dB@1KHz gives you a dynamic and enthralling music experience. Further, the noise-canceling boom microphone with micro-pop filter gives you studio like sound and cancels out any background noise so that you can speak clearly and enjoy the entire gaming experience. Comfortable Design The Logitech Prodigy G233 Gaming Headset is built with extreme precision and has an ergonomically comfortable design. It comes with specially designed optimized ear pads to provide you comfort so that you can use the headset for long periods of time with any irritation. The earpads surround the ear and provide just the right amount of force to stay firmly in place and comfortably breathable. The lightweight cup design isolates your hearing senses from the outside noise and allows you to immerse yourself into the gaming world. The headset is also console compatible and comes with a 2-meter long cable for flexible usage at all times."
  },
  {
    "name_small": "Cosmic Byte C1070T Interstellar Wired Gamepad (Black)",
    "price": "₹999.00",
    "Key features": "",
    "Main Product Features": {
      "Buttons": "12 numeric including Home, Start, Select"
    },
    "Additional Features": {
      "Other features": "360 degree analog sticks, Eight-way D Cross, Double triggers and analog bumpers, Special “Rapid Fire” with Turbo mode, Compatible with games running with Xinput or Dinput Mode"
    },
    "Dimension and Weigth": {
      "Weight (g)": "223",
      "Dimensions": "160 x 106 x 58 mm"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "1.8 (including 1.5 USB Cable + 0.3 OTG Cable）"
    },
    "Electrical Features": {
      "Input": "X-input and Direct-input (Integrated Dual Mode)"
    },
    "General": {
      "Type of Product": "Wired Gamepad",
      "Model Number": "C1070T Interstellar"
    },
    "Look and Feel": {
      "Colour option": "Black"
    },
    "Convenience Features": {
      "Indicators": "LED (connection charge, discharge)"
    },
    "Functional Features": {
      "Vibration Motor": "Dual"
    },
    "OS Compatibility": {
      "Windows Compatibility": "Windows XP, 7, 8, 8.1, 10 and  above"
    },
    "After Sales Service": {
      "Warranty": "1 year Warranty for manufacturing defects only"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-c1070t-interstellar-wired-gamepad-black-/p/207667",
    "description": "Description for Cosmic Byte C1070T Interstellar Wired Gamepad (Black) Your gaming experience is sure to be taken to amazing levels with the Cosmic Byte C1070T Interstellar Wired Gamepad. The gamepad gives you amazing comfort to make sure your gaming efficiency levels are always on point. The strategically places buttons make control easier to give you an edge over your opponents while the while the vibration feedback deeply engaged with the action. The comfortable to use 360-degree analog sticks ensure you have seamless control during your gaming session while the integrated Dual Mode provides greater compatibility for a wide range of games. The amazing control it provides back by an amazingly ergonomic design makes it the ideal gaming partner for you. Brilliant Gaming Control Enjoy an immersive gaming experience at all times with the Cosmic Byte C1070T Interstellar Wired Gamepad that is sure to keep you glued to your games thanks to its amazing features and controls. The Integrated Dual Mode - X-input and Direct-input- ensure greater compatibility for a wide range of games while the 12 numeric buttons and Ultra-precise eight-way D Cross ensure your gaming levels are always on point. The gamepad also comes with a Special Rapid Fire with [Turbo] mode to keep you ahead in the game while the Dual vibration motors further immerse you into a very exciting gaming experience. Ergonomic And Convenient Design Apart from having amazing features that enhance your gaming experience, the Cosmic Byte C1070T Interstellar Wired Gamepad also boasts a very ergonomic design which facilitates comfortable gameplay. The reimagined touchpad simplifies your gaming experience ergonomic comfortable to hold design along with highly responsive analog sticks and buttons make it your ideal gaming partner. You can easily plug in a USB to charge the controller while the LED indicators keep you informed about its functioning so that you enjoy uninterrupted gaming at all times."
  },
  {
    "name_small": "Cosmic Byte Aura B3506 Gaming Headphones (Multicolor)",
    "price": "₹1,899.00",
    "Key features": "",
    "Main Product Features": {
      "Microphone": "Yes"
    },
    "Suggested Usage": {
      "Wearing style": "Over the Ear"
    },
    "Additional Features": {
      "Other features": "Noise Cancellation, Inline Remote, Sales Package : Headphones, Audio Cable, Charging Cable, User manual, Deep Bass, System Requirements : PC, Mac, Android, iPhone, Closed Back, Wireless Range : 10 m, Battery Life (8 Hours), Battery Capacity (400 mAh), Charging Time (2 Hours)"
    },
    "Dimension and Weigth": {
      "Driver Unit (mm)": "40"
    },
    "Input Output Ports": {
      "Headphone jack": "3.5 mm Flatwire"
    },
    "Look and Feel": {
      "Design": "Sweat Proof, Foldable/Collapsible",
      "Colour": "Multicolor"
    },
    "General": {
      "Type": "Headphones",
      "Model Number": "Aura B3506"
    },
    "Product Material Features": {
      "Water Resistant": "Yes"
    },
    "Connectivity Type": {
      "Connectivity": "Bluetooth"
    },
    "Compatibility": {
      "compatibledevices": "Laptop, Audio Player, Studio Recording, Gaming Console, Tablet, Mobile, Television, PC, PS4, Xbox One"
    },
    "After Sales Service": {
      "Warranty": "1 Year"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-aura-b3506-gaming-headphones-multicolor-/p/207666",
    "description": "Description for Cosmic Byte Aura B3506 Gaming Headphones (Multicolor) Enhance your gaming experience to unprecedented levels as the Cosmic Byte Aura B3506 V2 Bluetooth Headphone with its well-built design and efficient functioning makes it an ideal gaming partner. The headset provides you with a premium sound experience as the drivers help you to immerse yourself in a world of virtual reality. The headset comes with a flexible microphone that helps you stay connected and communicate with various gamers to ensure your gaming performance doesn’t see a drop. The smart control makes it easy for you to operate the many functions of the headset conveniently while the foldable design makes storage and portability extremely easy. The headset combines the quality of audio and comfort together to give you an audio experience like never before. An Enhanced Audio Experience The Cosmic Byte Aura B3506 V2 Bluetooth Headphone ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion-free audio. The microphone gives you studio like sound and cancels out any background noise so that you can speak clearly and enjoy the entire headset experience while the easy control buttons allow you to enjoy optimum functionality from the headset. Comfortable Design The headset is built with extreme precision and has an ergonomically comfortable design. It comes with specially designed soft protein leather ear pads provide you comfort so that you can use the headset for long periods of time with any irritation. The adjustable headband makes it fit perfectly on your head. These amazing features are further accentuated with a foldable design that allows you to carry the headset with you wherever you go so that your gaming never stops."
  },
  {
    "name_small": "Cosmic Byte G1500 Gaming Headphones (Multicolour)",
    "price": "₹1,799.00",
    "Key features": "",
    "Suggested Usage": {
      "Wearing style": "On-Ear"
    },
    "Additional Features": {
      "Other features": "Vibrator: 30 mm, Directivity: Omnidirectional, Noise Reduction Sound Card And Vibration Mode , 7.1 Surround Gaming Headset, Flexible Tube, Freely Adjust At Any Direction,  Left Ear Cup : A Volume Controller And A Vibration Control Switch, Comfortable For Long Time Wear, Velcro Cable Tie, Prevent The Line Twining"
    },
    "Dimension and Weigth": {
      "Dimensions": "6.0 x 5.0 mm (Mic)",
      "Driver Unit (mm)": "50 (Diameter)"
    },
    "Cables and Connectors": {
      "Cable Type": "Aluminum Foil Flat, Comfortable Hand Feel, Durable",
      "Cable Length (m)": "2.2 (Approx)"
    },
    "Frequency Response": {
      "Frequency response": "20-20 KHz"
    },
    "Input Output Ports": {
      "USB Interface": "Yes"
    },
    "Audio Features": {
      "Impedance (Ohms)": "32",
      "Impedance": "2.2 kOhm (Mic)"
    },
    "Sensitivity": {
      "Sensitivity": "113dB +/- 3dB"
    },
    "Look and Feel": {
      "Design": "Colorful breathing LED lights, Matte Surface And Exquisite Lines (Ear Cups), Cool And Fashionable (Headphones)",
      "Colour": "Multicolour"
    },
    "General": {
      "Type": "Gaming Headphones",
      "Model Number": "G1500"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-g1500-gaming-headphones-multicolour-/p/207665",
    "description": "Description for Cosmic Byte G1500 Gaming Headphones (Multicolour) Enjoy an audio experience like never before as the Cosmic Byte G1500 Gaming Headset gives you a truly enhanced audio experience and improves your gaming needs like never before. The headset with its cup design is extremely comfortable to wear and provides premium virtual surround sound so that you can immerse yourself in a world of virtual reality. The RGB Visual Illumination gives out attractive lighting when you use it while the 7.1 surround sound gives you crystal clear gaming experience. The headset comes with a flexible microphone that can be adjusted easily and the noise canceling function blocks off any unnecessary sound. The headset combines the quality of audio and comfort together to give you an audio experience like never before. An Enhanced Audio Experience The Cosmic Byte G1500 Gaming Headset ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion-free audio. The 50 mm drivers and a sensitivity level of 113±3dB gives you a dynamic and enthralling music experience. Further, the Flexible Microphone gives you studio like sound and cancels out any background noise so that you can speak clearly and enjoy the entire headset experience. Comfortable Design The Cosmic Byte G1500 Gaming Headset is built with extreme precision and has an ergonomically comfortable design. It comes with oversized ear cups to provide you comfort so that you can use the headset for long periods of time with any irritation. The RGB lighting gives you multi-color lighting effects provide stunning illumination lighting and vibration effects. The cup design isolates your hearing senses from the outside noise and allows you to immerse yourself into the gaming world."
  },
  {
    "name_small": "Cosmic Byte GS410 Gaming Headphones (Blue)",
    "price": "₹999.00",
    "Key features": "",
    "Main Product Features": {
      "Microphone": "Yes"
    },
    "Suggested Usage": {
      "Wearing style": "Over the Ear"
    },
    "Additional Features": {
      "Other features": "Inline Remote, Sales Package : Main Unit, User Manual, Warranty, Deep Bass"
    },
    "Look and Feel": {
      "Colour": "Blue"
    },
    "General": {
      "Type": "Headphones",
      "Model Number": "GS410"
    },
    "Compatibility": {
      "compatibledevices": "Laptop, Audio Player, Gaming Console, Tablet, Mobile"
    },
    "After Sales Service": {
      "Warranty": "1 Year"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/cosmic-byte-gs410-gaming-headphones-blue-/p/207664",
    "description": "Description for Cosmic Byte GS410 Gaming Headphones (Blue) Your gaming experience is sure to take a notch higher with this power-packed Cosmic Byte GS410 Headset that comes with a lightweight and comfortable design to give you an audio experience like never before. The lightweight design is extremely easy to maintain and it is an ideal everyday audio partner for you. The pair of earphones are compatible with a wide variety of Laptop, Audio Player, Gaming Console, Tablet and Mobile phones making it a very flexible to use option. The headset also comes with a microphone which aids in crystal clear in-game communication making it the perfect option for you. Amazing Performance Not only can you hear your favorite songs but the Cosmic Byte GS410 Headset makes for a perfect option for your gaming needs as it provides sound that ensures you never miss a detail. The headset also comes with a built-in microphone that allows you to communicate with fellow gamers with ease to give you a truly immersive experience. Comfortable Design Apart from providing you with a breath-taking audio experience, the Cosmic Byte GS410 Headset boasts of a lightweight design which does not feel heavy in your ears. The over the head design ensures it stays firmly on your head while the padding ensures long hours of comfort so that your head or ears do not feel heavy after an intense gaming session. The in-line remote control aids in an easy and effective operation of the headset making it the perfect option for your gaming needs."
  },
  {
    "name_small": "Gamdias Hebe M1 RGB Surround Sound Gaming Headset (Black)",
    "price": "₹1,994.00",
    "Key features": "",
    "Suggested Usage": {
      "Wearing style": "Over the Ear"
    },
    "Input and Output connectors": {
      "Plug type": "Gold-plated USB plug"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2 m"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type": "Headset"
    },
    "Performance": {
      "Sensitivity": "119?3dB"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/gamdias-hebe-m1-rgb-surround-sound-gaming-headset-black-/p/204758",
    "description": "Description for Gamdias Hebe M1 RGB Surround Sound Gaming Headset (Black) Enjoy an audio experience like never before as the Gamdias Hebe M1 RGB Headset gives you a truly enhanced audio experience and improves your gaming needs like never before. The headset with its cup design is extremely comfortable to wear and provides 7.1 premium virtual surround sound so that you can immerse yourself in a world of virtual reality. The RGB Visual Illumination gives out attractive lighting when you use it while the 50mm HD drivers give you crystal clear gaming experience. The headset comes with a flexible microphone that can be adjusted easily and the noise cancelling function blocks off any unnecessary sound. The headset combines quality of audio and comfort together to give you an audio experience like never before. An Enhanced Audio Experience The Gamdias Hebe M1 RGB Headset ensures you experience a strong audio quality like never before to enrich your music and gaming experience. The compact design keeps out all the unnecessary background noise to give you clear distortion free audio. The 50mm HD drivers and a sensitivity level of 119�3dB gives you a dynamic and enthralling music experience. Further, Unidirectional flexible microphone gives you studio like sound and cancels out any background noise so that you can speak clearly and enjoy the entire headset experience. Comfortable Design The earphone is built with extreme precision and has an ergonomically comfortable design. It comes with oversized ear cups to provide you comfort so that you can use the headset for long periods of time with any irritation. The cup design isolates your hearing senses from the outside noise and allows you to immerse yourself into the gaming world. The retractable microphone is very easy to adjust to give you an enhanced video and voice calling experience. The smart in-line remote control allows you to operate the headset very conveniently."
  },
  {
    "name_small": "Razer KrakenPro V2 Analog Gaming Headset (Black)",
    "price": "₹5,999.00",
    "Key features": "",
    "Suggested Usage": {
      "Wearing style": "Headband"
    },
    "Input and Output connectors": {
      "Plug type": "3.5 mm Analog"
    },
    "Dimension and Weigth": {
      "Weight (g)": "322 g"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "1.3 m"
    },
    "Frequency Response": {
      "Frequency response": "12?28/000 Hz"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type": "Headphones"
    },
    "Performance": {
      "Sensitivity": "-38 ? 3 dB"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/razer-krakenpro-v2-analog-gaming-headset-black-/p/204656",
    "description": "Description for Razer KrakenPro V2 Analog Gaming Headset (Black) Ultimate Gaming Experience Experience the best gaming audio with the Razer KrakenPro V2 Analog Gaming Headset and have the best communication during your gaming sessions. They are outfitted with large drivers which produce a louder and richer sound. You will realize you are right in the game, while still hearing everything your team is talking about. The immersive and amplified quality gets you lost in all the action of the game and helps you have an awesome gaming session. Stylish and Trendy Design Made of Bauxite aluminum, the entire frame and design of the Razer Kraken Pro V2 is lightweight, flexible and incredibly durable. It does not get overweight and does not create a hindrance in your gaming or feels too uncomfortable. The ear cushions and the headband are designed precisely and lets you game for longer hours. The lightweight design does not put a stress on your head due to its balanced weight distribution and gives you maximum comfort during lengthy gaming sessions."
  },
  {
    "name_small": "Logitech G231 Prodigy Gaming Headset (Black)",
    "price": "₹3,500.00",
    "Key features": "",
    "Suggested Usage": {
      "Wearing style": "Over Ear"
    },
    "Input and Output connectors": {
      "Plug type": "Analog 4 poles 3.5 mm"
    },
    "Dimension and Weigth": {
      "Weight (g)": "255 (without cables)"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2 meters"
    },
    "Frequency Response": {
      "Frequency response": "20Hz-20KHz (Headphone)/ 50Hz-20KHz (Microphone)"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type": "Over Ear Headphones"
    },
    "Performance": {
      "Sensitivity": "90dB SPL/mW (Headphone)/ -40dBV/Pa (Microphone)"
    },
    "After Sales Service": {
      "Warranty": "2 Years Limited Hardware Warranty"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/logitech-g231-prodigy-gaming-headset-black-/p/203512",
    "description": "Description for Logitech G231 Prodigy Gaming Headset (Black) For every passionate gamer, every detail of the game is important. From a single pin-drop to bomb blast. If are looking for a headphone that offers you the detailed sound effect from your game, then the Logitech G231 Prodigy Gaming Headset is what you need. Now experience the excitement of the action games with more details. Technical Specifications The Logitech G231 Prodigy Gaming Headset is a brilliant product from the house of Logitech. The headphone with a frequency response ranging from 20Hz to 20KHz delivers a clear audio output. Moreover, with an impedance of 32 Ohms, the headphone goes perfectly with any laptop or computer. Connect it to your computer while playing a thrilling game and you can feel the adrenaline rush in your veins. This headphone provides the ultimate audio experience with its 90dB SPL/mW attribute. It also comes attached with a microphone (Boom) for audio input facility. So, you can even pick up calls with this headphone. This Pressure Gradient Electric Condenser type microphone works in a cardioid (unidirectional) pattern. It catches clear audio inputs with a sensitivity of 40dBV/Pa. Lightweight Design Logitech has designed the Logitech G231 Prodigy Gaming Headset keeping in mind the comfort of the user. You can keep this headphone on for hours without any discomfort. With Sports Mesh Cloth Ear Cups fitted on either side, it feels really comfortable throughout the marathon gaming sessions. Weighed at just 255g (without the cables), this feels light on your head. It has been assembled with a balance to provide you a seamless experience throughout the game and allows you to stay focused. In addition, you can also fold the headphone and carry it along. This feature also adds to the device�s portability. Game Quality Stereo Sound With the Logitech G231 Prodigy Gaming Headset, you will experience the thrills of the game coming alive. Sound plays a major role in the action games, and to deliver that performance, this headphone provides the ultimate sound quality using the 40 mm neodymium drivers. Compatible with computers and PlayStations, this is one solution for every gamer in distress. This Logitech G231 Prodigy Gaming Headset has compatibility with Xbox One, PlayStation 4 and PC. So, no matter what the device is, you are sure to have an astounding experience while playing your favourite game."
  },
  {
    "name_small": "Kotion Each GS400 Gaming Headset",
    "price": "₹1,299.00",
    "Key features": "",
    "Button Features": {
      "Buttons": "In-line rotary volume control"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "2.1 m"
    },
    "Input Output Ports": {
      "USB": "Yes/ for LED lights"
    },
    "Look and Feel": {
      "Colour": "Multicolor"
    },
    "General": {
      "Type": "Over-the-ear headset"
    },
    "Compatibility": {
      "Windows Compatibility": "Yes"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/kotion-each-gs400-gaming-headset/p/203030",
    "description": "Description for Kotion Each GS400 Gaming Headset Bring Your Game To Life! Experience the most lifelike sound in your gaming with Kotion Each GS400 Pro Gaming Headset. The headset is engineered to project powerful and immersive sound with rich bass effect, letting you feel your game for real. The premium headphones are designed with a bounty of remarkable features. Equipped with noise cancellation, they make quiet sound quieter and music sound deeper. Designed For Your Comfort The Kotion Each GS400 Gaming Headset is crafted with premium materials which make them lightweight and comfortable for an all-day immersive listening experience. They feature soft leather cushion ear pads and head pad that lend a feel-good wear. Being very nimble, their size can be freely and flexibly adjusted to perfectly fit while you don it. They also showcase an unparalleled suppleness and can be comfortably bent and folded. A Look That Arrests The GS400 exudes an imposing look and appeal. Utterly stylish, the headset comes with LED lights embedded on the ear cups, adding to the striking and exuberant look. Enlighten the atmosphere of the game with these glaring LEDs by simply plugging into a USB port with the USB connector provided along. Ergonomic Engineering Kotion Each GS400 gaming headphones are designed with a special Rotary Volume Controller button along the cable, with which you could easily control the volume. The key turns 360 degrees with sheer ease. The headset features a foldable microphone, enabling you to use it at the time when you need to. They also enjoy dual audio output with the help of Single Input Dual Output splitter connector that converts Audio and Mic into two separate outputs. Color as per availability."
  },
  {
    "name_small": "Kotion Each G2000 Gaming Headset",
    "price": "₹1,399.00",
    "Key features": "",
    "Button Features": {
      "Buttons": "In-line rotary volume control/ One key Mic mute"
    },
    "Input Output Ports": {
      "USB": "Yes/ for LED lights"
    },
    "Look and Feel": {
      "Colour": "as per stock availability"
    },
    "General": {
      "Type": "Headphones"
    },
    "Compatibility": {
      "Windows Compatibility": "Yes"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/kotion-each-g2000-gaming-headset/p/203009",
    "description": "Description for Kotion Each G2000 Gaming Headset Bring Your Game To Life! Experience the most lifelike sound in your gaming with Kotion Each G2000 Pro Gaming Headset. The headset is engineered to project powerful and immersive sound with rich bass effect, letting you feel your game for real. The premium headphones are designed with a bounty of remarkable features. They are equipped with high precision 50mm magnetic neodymium driver, bringing you vivid sound field and clarity. They also feature splendid ambient noise isolation. Designed For Your Comfort The Kotion Each G2000 Gaming Headset is crafted with premium materials which make them lightweight and comfortable for an all-day immersive listening experience. They feature leather earmuffs and super soft over ear pads that lend a feel-good wear. Being very nimble, their size can be freely and flexibly adjusted to perfectly fit while you don it. They also showcase an unparalleled suppleness and can be comfortably bent and folded. A Look That Arrests The G2000 exudes an imposing look and appeal. Utterly stylish, the headset comes with LED lights embedded on the ear cups and the microphone, adding to the striking and exuberant look. Enlighten the atmosphere of the game with these glaring LEDs by simply plugging into a USB port with the USB connector provided along. Ergonomic Engineering Kotion Each G2000 gaming headphones are designed with an in-line Rotary Volume Controller button that turns 360 degrees with ease. The headset features a foldable microphone, enabling you to use it at the time you need. They also enjoy dual audio input with the help of a splitter connector. The cable is braided and durable that effectively reduces the external resistance, while the velcro cable tie prevents line twining. Color as per availability."
  },
  {
    "name_small": "Logitech Stereo Headset H151 (Black)",
    "price": "₹1,249.00",
    "Key features": "",
    "Suggested Usage": {
      "Wearing style": "Headphone"
    },
    "Dimension and Weigth": {
      "Weight (g)": "80 g"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "1.8 m (5.90 ft)"
    },
    "Frequency Response": {
      "Frequency response": "Headset- 20Hz to 20kHz/   Microphone- 100Hz to 6/500Hz"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type": "Full stereo"
    },
    "Performance": {
      "Sensitivity": "headphone-?122dB +/-3dB/ moicrphone- -44dBV/PA +/-2.5dB"
    },
    "After Sales Service": {
      "Warranty": "1 year"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/logitech-stereo-headset-h151-black-/p/190539",
    "description": "Description for Logitech Stereo Headset H151 (Black) Compatibility at Its Best Logitech headsets are compatible with major operating system and platforms thanks to its standard 3.5mm jack connectivity. With Logitech headphones, you can easily adjust the volume or mute the microphone without touching your main device. Optimal Experience With Logitech headsets, you get to cut the background noise to enjoy clear and precise music. Moreover, it has Noise-cancelling Microphone feature which makes it even more convenient for you. This headset is ideal for gaming and online communication."
  },
  {
    "name_small": "Logitech Stereo Headset H111 (Black)",
    "price": "₹649.00",
    "Key features": "",
    "Dimension and Weigth": {
      "Weight (g)": "73.2"
    },
    "Cables and Connectors": {
      "Cable Length (m)": "1.8 m (5.90 ft)"
    },
    "Frequency Response": {
      "Frequency response": "20Hz to 20kHz of Headset"
    },
    "Look and Feel": {
      "Colour": "Black"
    },
    "General": {
      "Type": "PC Headset"
    },
    "Performance": {
      "Sensitivity": "100dB +/-3dB"
    },
    "After Sales Service": {
      "Warranty": "1 year"
    },
    "category": "computer audio",
    "url": "https://www.croma.com/logitech-stereo-headset-h111-black-/p/190538",
    "description": "Description for Logitech Stereo Headset H111 (Black) All-in-one Stereo headset The Logitech Stereo H111 lets you listen to music, play games or converse with others online with ease. It has 3.5mm jack connectivity and works with almost all systems and platforms. It is a light-weight headband with the right fit making it ideal for all types of users. Alternate Switching Microphone with Noise Cancellation The Microphone in the Logitech Stereo Headset H111 has a microphone with Noise cancellation feature that eliminate the background voice and provide crystal clear calls with family, friends or clients. The microphone can be rotated out of the way when you are not using it. It is also helpful when switching sides, it can be rotated effortlessly. Universal in Nature The Logitech headset is compatible on almost all operating systems and platforms and provides superior quality each time. It also works well with popular calling applications like Skype, Google Hangouts, Yahoo Messenger and other applications."
  }
]
